[
  {
    "id": 10,
    "jobTitle": "Senior Developer, Professional Services",
    "companyName": "Adobe",
    "status": 2,
    "dateApplied": "2024-07-12T00:00:00",
    "jobDescription": "Our Company\nChanging the world through digital experiences is what Adobe’s all about. We give everyone—from emerging artists to global brands—everything they need to design and deliver exceptional digital experiences! We’re passionate about empowering people to create beautiful and powerful images, videos, and apps, and transform how companies interact with customers across every screen. \n\nWe’re on a mission to hire the very best and are committed to creating exceptional employee experiences where everyone is respected and has access to equal opportunity. We realize that new ideas can come from everywhere in the organization, and we know the next big idea could be yours!\n\nThe Opportunity \nThis is an exciting opportunity to be part of a growing team that provides consulting services for Adobe Digital Media solutions! The Adobe consulting team is responsible for providing experienced skills in implementing Adobe applications and integrating complementary Adobe enterprise solutions, and collaborating with clients' existing IT infrastructure.\n\nWe are looking for an experienced and dedicated Full Stack Developer who functions as the Adobe technical authority. Their responsibility is to not only know about the product's hidden intricacies but to truly understand the implications of every function, setting, & integration available. A Full Stack Developer might not know everything, but they know enough to hunt down what they don’t know and communicate it to the client.\n\nQualifications\nEducation:\n\n Bachelor's degree in Computer Science, Software Engineering, or a related field. A Master's degree is a plus.\nTechnical Skills:\n\nKnowledge of RESTful APIs for building scalable and efficient applications using Adobe Firefly Services, Adobe PDF Services, and other 3rd party APIs.\nProficiency in front-end technologies such as HTML5, CSS3, JavaScript (including frameworks like React, Angular, or Vue.js).\nStrong back-end development skills with languages like Java, Python, Ruby, Node.js, or C#.\nExperience with server-side technologies and frameworks (e.g., Spring, Express.js, Ruby on Rails).\nDatabase expertise, including SQL and NoSQL databases (e.g., MySQL, PostgreSQL, MongoDB).\nFamiliarity with containerization and orchestration tools like Docker and Kubernetes.\nVersion control using Git and collaboration platforms like GitHub or GitLab.\nUnderstanding of cloud computing platforms (e.g., AWS, Azure, Google Cloud) and serverless architectures.\nProficiency in DevOps practices, CI/CD pipelines, and infrastructure as code (e.g., Terraform, Ansible).\nSecurity awareness, including best practices for securing web applications and data.\nExperience with Generative AI is a plus\nProfessional Experience:\n\nProven track record of developing full-stack applications in a professional setting.\nDemonstrated expertise in delivering end-to-end solutions, from requirements gathering to deployment and maintenance.\nExperience with Agile and Scrum methodologies and the ability to work in cross-functional teams.\nPrior work on projects involving large-scale data processing, automation, and bulk operations is helpful.\nKnowledge of software development standard processes, including code reviews, testing (unit, integration, and automated testing), and documentation.\nExperience in architecting and designing scalable and resilient systems.\nSoft Skills:\n\nStrong communication and interpersonal skills to interact effectively with clients, project managers, and cross-functional teams.\nProblem-solving attitude with the ability to troubleshoot complex technical issues.\nAdaptability and a willingness to learn and stay updated with emerging technologies.\nProject management skills to manage time and priorities effectively.\nClient-focused and able to translate business requirements into technical solutions.\nTeam collaboration and the ability to mentor junior developers.\nPortfolio:\n\nA strong portfolio showcasing past projects and code samples that demonstrate your full-stack development skills.\nSpecial Considerations\nExperience & knowledge with Generative AI\nKnowledge of Adobe Document Cloud solutions\nKnowledge of Adobe Creative Cloud solutions\nKnowledge of Adobe Experience Cloud solutions\nOpportunity and affirmative action employer. We do not discriminate based on gender, race or color, ethnicity or national origin, age, disability, religion, sexual orientation, gender identity or expression, veteran status, or any other applicable characteristics protected by law. Learn more. \n\nAdobe aims to make Adobe.com accessible to any and all users. If you have a disability or special need that requires accommodation to navigate our website or complete the application process, email accommodations@adobe.com or call (408) 536-3015. \n\nAdobe values a free and open marketplace for all employees and has policies in place to ensure that we do not enter into illegal agreements with other companies to not recruit or hire each other’s employees.\n\nOur compensation reflects the cost of labor across several  U.S. geographic markets, and we pay differently based on those defined markets. The U.S. pay range for this position is $139,400 -- $235,700 annually. Pay within this range varies by work location and may also depend on job-related knowledge, skills, and experience. Your recruiter can share more about the specific salary range for the job location during the hiring process.",
    "notes": "",
    "minSalary": 139400,
    "maxSalary": 235700,
    "postingUrl": "https://careers.adobe.com/us/en/job/R145578/Senior-Developer-Professional-Services",
    "hiringTeam": null,
    "techStack": []
  },
  {
    "id": 44,
    "jobTitle": "Senior Software Engineer, Backend (Identity Decisioning)",
    "companyName": "Affirm",
    "status": 0,
    "dateApplied": "2024-07-13T04:32:32.964",
    "jobDescription": "Affirm is reinventing credit to make it more honest and friendly, giving consumers the flexibility to buy now and pay later without any hidden fees or compounding interest.\n\nWe are looking for a Senior Software Engineer to join the Identity Decisioning team, responsible for building backend systems that validates consumer identity in all of Affirm’s products by satisfying regulatory protocols like KYC. The team partners closely with Product, Compliance, Auth, Fraud, and other engineering teams to deliver honest and transparent financial products that help consumers make their purchasing decisions. As we scale the company to be a cornerstone of all e-commerce and offline retail, it is an exciting time to join the team which sits at the core of this mission. \n\nWhat You’ll Do\nCollaborate with other Software Engineers to design, maintain, and evolve existing architecture that grows the business and unlocks new product initiatives. \nDrive detailed project definition, design, technical specification, cross-functional alignment, task breakdown, and delivery. \nProactively raise any issues or improvement opportunities in our product, technology, or business processes and contribute ideas to deliver them.\nProvide technical leadership to ensure the delivery of reliable, scalable, and performant technical solutions\nBuild teams by mentoring other engineers, informing and influencing hiring decisions, and building an inclusive team environment\nProvide input into planning our product, codebase, infrastructure, team goals, and roadmap.\nWhat We Look For\nThis position requires either equivalent practical experience or a Bachelor’s degree in a related field\n4+ years of experience designing, building, launching, and maintaining complex systems\nFamiliarity with Python ecosystem - Flask, Mypy, Pytest, etc.\nStrong cross-team communication and collaboration skills\nA leader, team builder, and mentor\nPassionate about Affirm's Mission: \"Deliver Honest Financial Products that improve lives\"\nExperience in Risk Engineering domain\nBase Pay Grade - N\nEquity Grade - 8\n\nEmployees new to Affirm typically come in at the start of the pay range. Affirm focuses on providing a simple and transparent pay structure which is based on a variety of factors, including location, experience and job-related skills.\n\nBase pay is part of a total compensation package that may include equity rewards, monthly stipends for health, wellness and tech spending, and benefits (including 100% subsidized medical coverage, dental and vision for you and your dependents.)\n\nUSA base pay range (CA, WA, NY, NJ, CT) per year: $190,000 - $240,000\n\nUSA base pay range (all other U.S. states) per year: $169,000 - $219,000\n\n",
    "notes": "",
    "minSalary": 169000,
    "maxSalary": 219000,
    "postingUrl": "https://boards.greenhouse.io/affirm/jobs/6015238003",
    "hiringTeam": null,
    "techStack": []
  },
  {
    "id": 45,
    "jobTitle": "Software Engineer II, Backend (Qualifications)",
    "companyName": "Affirm",
    "status": 0,
    "dateApplied": "2024-07-14T00:00:00",
    "jobDescription": "Affirm is reinventing credit to make it more honest and friendly, giving consumers the flexibility to buy now and pay later without any hidden fees or compounding interest.\n\nAffirm’s mission is to build honest financial products to improve user’s lives. We are seeking a Software Engineer to build parts of Affirm's backend Qualification platform which allows users to know their spending power across all merchants for each of Affirm's products. You will investigate, spec, design, and implement systems to power our synchronous user-initiated and offline proactive prequalification system. Your technical leadership will have a high impact on the future growth of Affirm, as we aim to provide honest financial products throughout the world!\n\nWhat You’ll Do\n\nWork with technical leaders in the team to design and implement insightful forward-looking approaches that go beyond the direct team and solve large open-ended problems.\n\nCollaborate with engineers within the Qualifications team and across other product and credit engineering teams to build a scalable backend that powers all pre-qualifications across Affirm.\n\nTake ownership over parts of the Qualifications system.\n\nWrite high-quality code that can be easily understood and leveraged by others.\n\nReview others’ work and provide constructive feedback in order to maintain high and consistent quality standards across teams.\n\nConduct technical evaluations to inform and influence the hiring decisions.\n\nWhat we Look For\n\n2+ years of experience as a Software Engineer.\n\nEager to learn new things and have a growth mindset.\n\nFluency in backend development.\n\nFamiliarity with Python, AWS, and Kubernetes is a plus.\n\nPrior experience designing, building, launching, and maintaining consumer scale products.\n\nStrong cross-team communication and collaboration skills.\n\nExperienced at synthesizing complex business, product, and technical requirements to consistently produce high quality system designs and software.\n\nHumble and authentic leadership which places the needs of others first and helps people develop and perform as highly as possible.\n\nExperience scaling systems in a service oriented architecture.\n\nHumility and self-awareness to understand and navigate the unknown.\n\n\nPay Grade - L\n\nEquity Grade - USA 6\n\nEmployees new to Affirm typically come in at the start of the pay range. Affirm focuses on providing a simple and transparent pay structure which is based on a variety of factors, including location, experience and job-related skills.\n\nBase pay is part of a total compensation package that may include equity rewards, monthly stipends for health, wellness and tech spending, and benefits (including 100% subsidized medical coverage, dental and vision for you and your dependents.)\n\nUSA base pay range (CA, WA, NY, NJ, CT) per year: $160,000 - $210,000\nUSA base pay range (all other U.S. states) per year: $142,000 - $192,000\n",
    "notes": "",
    "minSalary": 142000,
    "maxSalary": 192000,
    "postingUrl": "https://boards.greenhouse.io/affirm/jobs/6032715003",
    "hiringTeam": null,
    "techStack": []
  },
  {
    "id": 46,
    "jobTitle": "Senior Software Engineer, Backend (Loan Originations & Reporting)",
    "companyName": "Affirm",
    "status": 0,
    "dateApplied": "2024-07-08T04:37:37",
    "jobDescription": "Affirm is reinventing credit to make it more honest and friendly, giving consumers the flexibility to buy now and pay later without any hidden fees or compounding interest.\n\nThe Loan Origination and Reporting team (LOR) is responsible for the creation of all loans with Affirm. We make reliable, scalable systems that can handle loan requests from our continually growing customer base. Our team's main users include the bank partners who originate our loans, and other engineering teams that use our services. In the future, we will be extending our reach to countries outside the U.S., signing on new customers, new merchants, and new bank partners along the way.\n\nWhat You’ll Do\n\nDesign, code, and maintain services that enable the origination of hundreds of millions of dollars worth of loans and can scale to meet our growing demand\nBuild batch processes and integrate data pipelines to automate data sourcing and reporting workflows\nMentor junior teammates, review their code, and help them learn the skills and methodologies needed to become outstanding engineers\nWork with technical and non-technical business partners to discuss project plans and status\nContinually look for ways to improve both LOR systems and Affirm Engineering as a whole\nWhat We Look For\n\nThis position requires either equivalent practical experience or a Bachelor’s degree in a related field\n4+ years of experience as a software engineer with leadership exposure and experience mentoring junior engineers\nPassion for technology and solving problems with software\nProficiency and experience in back-end development and distributed systems (our tech stack includes Python, Spark, Kubernetes, MySQL, and AWS)\nProficient in backend data processing and batch processing\nStrong cross-team communication and collaboration skills\nPrior experience with SOA and event-driven systems a plus\nBase Pay Grade - N\nEquity Grade - 8\n\nEmployees new to Affirm typically come in at the start of the pay range. Affirm focuses on providing a simple and transparent pay structure which is based on a variety of factors, including location, experience and job-related skills.\n\nBase pay is part of a total compensation package that may include equity rewards, monthly stipends for health, wellness and tech spending, and benefits (including 100% subsidized medical coverage, dental and vision for you and your dependents.)\n\nUSA base pay range (CA, WA, NY, NJ, CT) per year: $190,000 - $240,000\n\nUSA base pay range (all other U.S. states) per year: $169,000 - $219,000",
    "notes": "",
    "minSalary": 169000,
    "maxSalary": 219000,
    "postingUrl": "https://boards.greenhouse.io/affirm/jobs/5958220003",
    "hiringTeam": null,
    "techStack": []
  },
  {
    "id": 48,
    "jobTitle": "Senior .NET Software Engineer - equal back end and front end",
    "companyName": "Johnson Controls",
    "status": 2,
    "dateApplied": "2024-07-08T04:40:45",
    "jobDescription": "https://jobs.johnsoncontrols.com/job/20341286/senior-net-software-engineer-equal-back-end-and-front-end-remote-raleigh-nc/\nBuild your best future with the Johnson Controls team!\n\nFM:Systems, now a part of Johnson Controls (JCI), provides workplace management technology and solutions that enable facility and real estate teams to identify, plan and deliver the ideal workplace for every employee. Our broad solutions portfolio of software and hardware, specializing in space management and optimization, assets and maintenance, strategic real estate planning, resource scheduling, as well as projects and sustainability, empowers our clients to gain insight into how their facility space is performing, how they enhance efficiency and crate an employee-centric workplace.\n\nAs a global leader in smart, healthy, and sustainable buildings, our mission is to reimagine the performance of buildings to serve people, places, and the planet.  Join a winning team that enables you to build your best future! Our teams are uniquely positioned to support a multitude of industries across the globe. You will have the opportunity to develop yourself through significant work projects and learning opportunities. We strive to provide our employees with an experience, focused on supporting their physical, financial, and emotional wellbeing. Become a member of the Johnson Controls family and thrive in an empowering company culture where your voice and ideas will be heard – your next great opportunity is just a few clicks away! \n\nWhat we offer:\n\nCompetitive salary \n\nPaid vacation/holidays/sick time \n\nComprehensive benefits package including 401K, medical, dental, and vision care. \n\nOn the job/cross training opportunities \n\nEncouraging and collaborative team environment \n\nDedication to safety through our Zero Harm policy \n\nCheck us out:  A Day in a Life at Johnson Controls\n\n​\n\nWhat you will do:\n\nFM:Systems is looking for a Senior .NET Software Engineer – Front end and Back end with a strong background developing and maintaining enterprise web applications to join our Product Engineering team.  This role is a senior level position for a very experienced .NET engineer. This person will play a crucial role enhancing and maintaining our web applications as a technology leader as well as expanding our technology teams’ capabilities.  The senior software engineering position will require someone who enjoys being a technical leader within a team to bridge product needs to technical solutions.  You should be passionate about building the right solutions right and be comfortable working in a dynamic environment where flexibility and communication is essential.  This is a great opportunity for you to join a growing team that encourages creativity, teamwork, professional growth, and advancement.\n\nHow you will do it:\n\nWork as a lead developer to deliver the right product functionality from UI to middleware/API to database.\n\nCode in VB, C#, React and other languages to enhance and maintain our web application.  Our application is a mix of C# and VB.\n\nActively participate in our evaluation and long-term implementation of technology enhancements.\n\nContribute substantially to the architecture and design of our applications that enable implementation of solid solutions.\n\nWork with the team to ensure appropriate SDLC processes are followed. \n\nEnsure quality, performance, usability, and maintainability are built into our solutions at the right balance.\n\nWork with other technical leaders to ensure consistency across our applications and development processes.\n\nCommunicate and coordinate effectively as a technical delivery leader within the team, across our technology teams, and with our business partners to deliver on top priorities!\n\nMentor other engineers, encouraging engineering best practices, demonstrating how to create effective designs and write maintainable, reusable code.\n\nCollaborate with UX experts to evolve our SaaS applications.\n\n​\n\nWhat we look for:\n\nBachelor’s degree in a computer related degree program or equivalent work experience.\n\n8+ years of professional Software Engineering experience.\n\n8+ years of experience developing in the .NET framework with ASP.NET MVC, ASP.NET, and Web API.\n\n8+ years of C# and/or VB programming experience.  While most coding will be in VB, we will consider candidates that do not have prior VB.NET experience.\n\n5+ years of MS SQL experience and ability to demonstrate strength with stored procedures, queries, tuning and debugging.\n\nExperience developing JavaScript, CSS, and HTML with a solid understanding of at least one JavaScript framework.\n\nStrong experience with implementing unit tests.\n\nExperience building and tuning RESTful APIs.\n\nExperience producing designs to represent solutions to product and customer needs.\n\nExperience with deployment methodologies such as CI/CD and Octopus.\n\nA history of successfully implementing software development patterns and best practices such as dependency injection.\n\nAbility to successfully interface with business stakeholders and engineers to deliver the right solution that balances product, quality, technical, and timeline requirements.\n\nAbility to translate technical requirements into elegant code solutions.\n\nPassion for mentoring junior engineers to produce elegant, maintainable technology deliverables.\n\nExcellent written and verbal communication skills.\n\nA self-starter with an acute sense of ownership and the ability, passion, creativity, and confidence to independently problem solve and produce results.\n\nStrong history of moving quality to the left including extensive unit testing experience. \n\nExperience working with Agile development practices.\n\n​\n\nDesired Skills\n\n.NET Core development experience.\n\nWorking knowledge of API authorization and authentication protocols such as OAuth2 and OpenID Connect.\n\nExperience building and consuming micro-frontend components.\n\nExperience with React and responsive frameworks.\n\nFamiliarity with modern test tools, technologies, and analytics.\n\nExperience using Git or GitHub.\n\nExperience with Jira or similar tools.\n\nExperience with Octopus and other modern dev-ops tools.\n\nAWS deployment and hosting experience.\n\nApplications are accepted on an ongoing basis.",
    "notes": "",
    "minSalary": 0,
    "maxSalary": 0,
    "postingUrl": null,
    "hiringTeam": null,
    "techStack": []
  },
  {
    "id": 49,
    "jobTitle": "Sr. Software Engineer - Supply Chain Platform",
    "companyName": "Publix",
    "status": 2,
    "dateApplied": "2024-07-09T04:45:51",
    "jobDescription": "",
    "notes": "",
    "minSalary": 0,
    "maxSalary": 0,
    "postingUrl": null,
    "hiringTeam": null,
    "techStack": []
  },
  {
    "id": 50,
    "jobTitle": "Senior Software Engineer - Retail Fresh Delivery",
    "companyName": "Publix",
    "status": 2,
    "dateApplied": "2024-07-09T04:45:51",
    "jobDescription": "",
    "notes": "",
    "minSalary": 0,
    "maxSalary": 0,
    "postingUrl": null,
    "hiringTeam": null,
    "techStack": []
  },
  {
    "id": 51,
    "jobTitle": "Senior Software Engineer - Enterprise Item Management",
    "companyName": "Publix",
    "status": 2,
    "dateApplied": "2024-07-09T04:45:51",
    "jobDescription": "",
    "notes": "",
    "minSalary": 0,
    "maxSalary": 0,
    "postingUrl": null,
    "hiringTeam": null,
    "techStack": []
  },
  {
    "id": 52,
    "jobTitle": "Senior Software Engineer",
    "companyName": "Microsoft",
    "status": 0,
    "dateApplied": "2024-07-09T05:01:33",
    "jobDescription": "https://jobs.careers.microsoft.com/global/en/job/1727557\nOverview\nWe are looking for a Senior Software Engineer to join the Commerce Catalog team that supports both consumer and commercial product offerings for Microsoft. This is a high reliability/high scale service that requires great architecture, design and future extensibility.  We span a variety of technical areas including various storage technologies, to backend API design, to Kubernetes and containers.  We support a wide variety of product offerings and types that requires broad understanding of the Commerce stack and how to translate those requirements to extensible designs. You will be empowered for envisioning, designing, coding, validating, and shipping key features with massive customer impact. You will have the opportunity to work with several teams across the company, giving you wide exposure to multiple product families.\n\n \n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond. \n\n \n\nIn alignment with our Microsoft values, we are committed to cultivating an inclusive work environment for all employees to positively impact our culture every day.  \n\n \n\nQualifications\nRequired/Minimum Qualifications:\n\nBachelor's Degree in Computer Science, or related technical discipline AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\nOther Requirements:\n\n \n\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: \n\nMicrosoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\nPreferred/Additional Qualifications:\n\n8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nSoftware Engineering IC4 - The typical base pay range for this role across the U.S. is USD $117,200 - $229,200 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $153,600 - $250,200 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay\n\nMicrosoft will accept applications for the role until July 17, 2024.\n\n \n\n\nResponsibilities\nUnderstand User Requirements\n\n· Partners with appropriate stakeholders to determine user requirements for a set of scenarios\n\n· Leverages a variety of feedback channels to incorporate insights into future designs or solution fixes.\n\n \n\nDesign\n\n· Leads discussions for the architecture of products/solutions and creates proposals for architecture by testing design hypotheses and helping to refine code plans.\n\n· Drives identification of dependencies and the development of design documents for a product, application, service or platform.\n\n \n\nCoding\n\n· Leads by example within the team by producing extensible and maintainable code.\n\n· Optimizes, debugs, refactors, and reuses code to improve performance and maintainability, effectiveness, and return on investment.\n\n \n\nImplement\n\n· Leverages subject-matter expertise of product features and partners with appropriate stakeholders to drive a workgroup's project plans, release plans, and work items.\n\n· Drives creation and experimentation to determine the effectiveness of changes, monitors developments for prototyping and testing products, and interprets results.\n\n \n\nReliability and Supportability\n\n· Maintains operations of live service as issues arise on a rotational, on-call basis. \n\n· Drives efforts to reduce incident volume, looking globally at incidences and providing broad resolutions. Escalates issues to appropriate owners.\n\n \n\nEngineering Excellence\n\n· Builds, enhances, reuses, contributes to, and identifies new software developer tools to support other programs and applications to create, debug, and maintain code for products.\n\n· Acts as a key contact for leadership to ensure alignment with partners' expectations. \n\nOther\n\nEmbody our Culture and Values\n",
    "notes": "",
    "minSalary": 117200,
    "maxSalary": 229200,
    "postingUrl": null,
    "hiringTeam": null,
    "techStack": []
  },
  {
    "id": 53,
    "jobTitle": "Software Engineering II",
    "companyName": "Microsoft",
    "status": 2,
    "dateApplied": "2024-07-09T05:11:08",
    "jobDescription": "Overview\nThe One Engineering System (1ES) team inside Microsoft's Cloud and AI division is looking for a Software Engineer II to work with us on the next generation of developer services and tools.\n\n \n\nSoftware developers are the productivity workforce of the future. With the developer tools & services market quickly growing and evolving, we have a unique opportunity to help shape internal engineering practices at Microsoft and the broader industry. Our large-scale distributed services for build and test are at the center of Microsoft developers’ workflows and comprise a large part of Microsoft’s internal One Engineering System.\n\n \n\nThe primary responsibilities of this role are to design and code new software and services to be used by tens of thousands of Microsoft’s engineers and the broader DevOps market. You will work extensively on building developer services that are loved and relied upon. If you are passionate about software engineering, are excited by constantly learning in an ever-changing environment and market and above all love to focus on customers and building products they love – we want to hear from you!\n\n \n\nWe believe that being a great team member is as important as being a great technologist. We strive to live in a world where everyone on the team has an equal voice, is empowered to innovate and can make a big impact. While there are many tools in the toolbox, we are passionate about Test Driven Development, Continuous Integration, Continuous Delivery, Culture of Experimentation and Lean Agile as a way of operating.\n\n \n\nIf you want to be part of shaping the future of software development at Microsoft and the industry and this sounds like the right environment for you - join us!\n\n \n\n \n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond\n\n \n\nQualifications\nRequired Qualifications \n\nBachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience\n \n\nOther Requirements \n\n \n\nBackground Check: Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings:  \n\n \n\nMicrosoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter. \n\n \n\nPreferred Qualifications\n\nMaster's degree in Computer Science, Engineering, related fields or equivalent experience\nProblem solving, debugging, and troubleshooting skills\nExperience with cross-discipline and cross-team collaboration\nExcellent technical communication skills\nAwareness of, and ability to reason about, modern software & systems architectures, including load-balancing, queueing, caching, distributed systems failure modes generally, microservices, and so on.\n3+ years of software development: automation-related experience valued in particular. Scripting languages such as bash, python, and PowerShell, or compiled languages such as C, C# and Go are most relevant but others are acceptable.\nExperience with working in a team, including on large projects, communicating well, and exercising initiative when presented with problems.\nSoftware Engineering IC3 - The typical base pay range for this role across the U.S. is USD $98,300 - $193,300 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $127,200 - $208,800 per year.\n\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: US corporate pay information | Microsoft Careers\n\n \n\nMicrosoft will accept applications for the role until July 10, 2024.\n\n \n\n\n \n\nDDJL, #1ES\n\nResponsibilities\nThe scale of our operations is enormous. Microsoft's products and services are overwhelmingly consumed online, and billions of people use them every day. We need people who enjoy analyzing complicated problems, coming up with creative solutions, working in focused teams to build things no-one has thought of before, all in the service of production reliability.\n\n \n\nIf you are excited by this type of challenge, and you love to work in groups of people who are similarly excited, come join us. We value the input of people who aren't afraid to be learning all the time, who celebrate mistakes because they show the way forward, and those who are happy to continuously improve. We strongly believe that diverse experiences and backgrounds, and an environment where everyone can feel safe to contribute their own insights in a data-driven, objective, but the supportive way is the key to making the best workplace possible, and the best workplace makes the best products and services. Not only is it the smart thing, it's the right thing.\n\n \n\nWe would like to talk to you if you:\n\nAre interested in distributed systems and working with high scale services.\nLike to work in a fast-moving environment and you aren't afraid to change things to make them better.\nEnjoy new technological challenges and solving hard problems.\nBelieve that a team working well together is truly smarter than the single smartest person on that team.\nAspire to grow as a person, as a teammate, and as an engineer.\nEmbody our Culture and Values",
    "notes": "",
    "minSalary": 98300,
    "maxSalary": 193300,
    "postingUrl": "https://jobs.careers.microsoft.com/global/en/job/1735216",
    "hiringTeam": null,
    "techStack": []
  },
  {
    "id": 54,
    "jobTitle": "Intermediate Software Engineer – Corporate Systems",
    "companyName": "Publix",
    "status": 2,
    "dateApplied": "2024-07-11T05:11:08",
    "jobDescription": "",
    "notes": "",
    "minSalary": 0,
    "maxSalary": 0,
    "postingUrl": null,
    "hiringTeam": null,
    "techStack": []
  },
  {
    "id": 55,
    "jobTitle": "Intermediate Software Engineer – Item Modernization Team",
    "companyName": "Publix",
    "status": 2,
    "dateApplied": "2024-07-11T05:11:08",
    "jobDescription": "",
    "notes": "",
    "minSalary": 0,
    "maxSalary": 0,
    "postingUrl": null,
    "hiringTeam": null,
    "techStack": []
  },
  {
    "id": 56,
    "jobTitle": "Sr Software Engineer",
    "companyName": "Disney",
    "status": 0,
    "dateApplied": "2024-07-11T05:11:08",
    "jobDescription": "",
    "notes": "",
    "minSalary": 0,
    "maxSalary": 0,
    "postingUrl": null,
    "hiringTeam": null,
    "techStack": []
  },
  {
    "id": 57,
    "jobTitle": "Sr Software Engineer",
    "companyName": "Disney",
    "status": 0,
    "dateApplied": "2024-07-11T05:11:08",
    "jobDescription": "",
    "notes": "",
    "minSalary": 0,
    "maxSalary": 0,
    "postingUrl": null,
    "hiringTeam": null,
    "techStack": []
  },
  {
    "id": 58,
    "jobTitle": "Sr Developer",
    "companyName": "Disney",
    "status": 0,
    "dateApplied": "2024-07-11T05:11:08",
    "jobDescription": "",
    "notes": "",
    "minSalary": 0,
    "maxSalary": 0,
    "postingUrl": null,
    "hiringTeam": null,
    "techStack": []
  },
  {
    "id": 59,
    "jobTitle": "Software Engineer II , Data Platform",
    "companyName": "Included Health",
    "status": 0,
    "dateApplied": "2024-07-11T05:11:08",
    "jobDescription": "https://www.linkedin.com/jobs/view/3948441883/?trackingId=6S4DsEncTkGWfNWCk5wVPw%3D%3D&refId=VoGD2mCMTIiRrXTYQD6A%2Bw%3D%3D&midToken=AQGfE7Prgbz6YQ&midSig=3VOmWpRYxRCHk1&trk=eml-email_application_confirmation_with_nba_01-applied_jobs-0-jobcard_body&trkEmail=eml-email_application_confirmation_with_nba_01-applied_jobs-0-jobcard_body-null-4zggql~lyho23n3~91-null-null&eid=4zggql-lyho23n3-91&otpToken=MTEwNTFmZTQxMzI3Y2RjMWI3MjQwNGVkNDQxZWUwYjY4OWNkZDg0MDllYWU4YTYxNzZjZTA3NmU0ODVjNWNmMmYzZGY5MjllMTFlYWU0ZDQ0NmIyYTZhNzJjODliY2QwNTYzMzQzYjRiYmJmNjk4ZjA1OTcsMSwx\nAbout the job\nOur Team’s Impact\n\nThe data infrastructure team is responsible for the data platform that supports Included Health’s technical strategy. This platform manages data processing for our engineering, data science, and analytics teams, ensuring efficient, reliable, and predictable outcomes. Over the next two years, the data infrastructure team will play a crucial role in the organization by developing a cutting-edge, event-driven data platform.\n\nAbout The Role\n\nWe are seeking a motivated software engineer to join our Data Infrastructure team. In this role, you will contribute to the development of our next-generation data platform and collaborate with a talented team of engineers. Our data is unique, and our platform is filled with opportunities. We are looking for enthusiastic talent eager to advance our technology and business to transform the healthcare industry.\n\nWhat You'll Do\n\nAssist in designing and implementing the company’s next-generation event-driven data platform.\nCollaborate with team members to facilitate adoption and resolve dependency conflicts.\nPrioritize for high-value outcomes.\nContribute to improving personal, team, and cross-team efficiency.\nEngage in code reviews and promote best practices.\nHelp identify and address technical debt.\n\nYour Qualifications\n\nYou have some experience or academic background in data infrastructure, data engineering, or machine learning.\nYou possess a good understanding of data processing technologies and software engineering principles.\nFamiliarity with Spark, Kubernetes, networking, distributed systems, and event-driven architecture for streaming applications is a plus.\nYou have solid programming skills and a grasp of computer science fundamentals.\nYou are motivated by impact and are committed to delivering high-quality software solutions.\nYou are passionate about software development and are looking to grow your skills in a dynamic team environment.\nOur data is unique, and our platform is filled with possibilities. We are looking for motivated talent who wants to take our technology and business to the next level to disrupt the healthcare industry as we know it today.\n\nThe United States new hire base salary target ranges for this full-time position are:\n\nZone A: [132,400-196,950] + equity + benefits\n\nZone B: [110,300 - 164,150] + equity + benefits\n\nThis range reflects the minimum and maximum target for new hire salaries for candidates based on their respective Zone. Below is additional information on Included Health's commitment to maintaining transparent and equitable compensation practices across our distinct geographic zones. Starting base salary for the successful candidate will depend on several job-related factors, unique to each candidate, which may include, but not limited to, education; training; skill set; years and depth of experience; certifications and licensure; business needs; internal peer equity; organizational considerations; and alignment with geographic and market data. Compensation structures and ranges are tailored to each zone's unique market conditions to ensure that all employees receive fair and competitive compensation based on their roles and locations. Your Recruiter can share details of your geographic alignment upon inquiry.\n\nIn addition to receiving a competitive pay, the compensation package may include, depending on the role, the following:\n\nRemote-first culture\n401(k) savings plan through Fidelity\nComprehensive medical, vision, and dental coverage through multiple medical plan options (including disability insurance)\nFull suite of Included Health telemedicine (e.g. behavioral health, urgent care, etc.) and health care navigation products and services offered at no cost for employees and dependents\nGenerous Paid Time Off (\"PTO\") and Discretionary Time Off (“DTO\")\n12 weeks of 100% Paid Parental leave\nUp to $25,000 Fertility and Family Building Benefit Compassionate Leave (paid leave for employees who experience a failed pregnancy, surrogacy, adoption or fertility treatment)\n11 Holidays Paid with one Floating Paid Holiday\nWork-From-Home reimbursement to support team collaboration and effective home office work\n24 hours of Paid Volunteer Time Off (“VTO”) Per Year to Volunteer with Charitable OrganizationsYour recruiter will share more about the benefits package for your role during the hiring process.",
    "notes": "",
    "minSalary": 110000,
    "maxSalary": 164150,
    "postingUrl": null,
    "hiringTeam": null,
    "techStack": []
  },
  {
    "id": 60,
    "jobTitle": "Software Engineer",
    "companyName": "FinThrive",
    "status": 0,
    "dateApplied": "2024-07-11T05:11:08",
    "jobDescription": "https://jobs.dayforcehcm.com/en-US/finthrive/CANDIDATEPORTAL/jobs/2576\nJob Description\nPosted Monday, May 20, 2024 at 12:00 AM\nAbout FinThrive\n\nFinThrive is advancing the healthcare economy.\nFor the most recent information on FinThrive’s vision for healthcare revenue management visit finthrive.com/why-finthrive.\n\n\nAward-winning Culture of Customer-centricity and Reliability\n\nAt FinThrive we’re proud of our agile and committed culture, which makes FinThrive an exceptional place to work. Explore our latest workplace recognitions at https://finthrive.com/careers#culture.\n\n \n\nOur Perks and Benefits\n\nFinThrive is committed to continually enhancing the colleague experience by actively seeking new perks and benefits. For the most up-to-date offerings visit finthrive.com/careers-benefits.\n\n \n\nAbout the Role\n\nImpact you will make\n\nAs a Software Engineer with FinThrive, you will be supporting a group that producing what is called grouping and pricing software that is use by insurance companies and hospitals to do their medical billing reimbursement.  FinThrive takes pride in providing healthcare solutions that provide accurate and timely results that benefit healthcare organizations.\n\n \n\nWhat you will do\n\nDevelop new features, maintain and enhance existing functionality\nCommunicate effectively with team members and evaluate alternative business solutions\nEnsure unit tests written for all new code\nSeek opportunities to incorporate new technologies into the product’s technology stack when they can add value\nWork directly with support organizations to resolve production issues\nProvide production release support\nProvide application support by analyzing defects, replicating/fixing defects and providing root cause analysis for defects\nDemonstrate ability to work with team members, onsite as well as remote\nParticipate in delivering team commitments, dev, QA, documentation, etc.\n \n\nWhat you will bring\n\nBachelor’s degree in related field\n3+ years of experience in Software Development\nExperience in developing software in an Agile environment\nSQL Server development\nCobol: Reading and updating code.\nExcellent oral and written communications skills\n \n\nWhat we would like to see\n\n \n\nBachelor’s degree in related field\nHealthcare domain knowledge\nFamiliarity with grouping and pricing methodologies and terminology\nExperience with InstallShield or other Windows local installer platforms such as WiX\nExperience with the following:\nWorking with various VM’s in a windows environment\nSeek development opportunities above and beyond required training\n",
    "notes": "",
    "minSalary": 0,
    "maxSalary": 0,
    "postingUrl": null,
    "hiringTeam": null,
    "techStack": []
  },
  {
    "id": 61,
    "jobTitle": "Software Engineer",
    "companyName": "NBCUniversal",
    "status": 2,
    "dateApplied": "2024-07-12T05:11:08",
    "jobDescription": "",
    "notes": "",
    "minSalary": 0,
    "maxSalary": 0,
    "postingUrl": null,
    "hiringTeam": null,
    "techStack": []
  },
  {
    "id": 62,
    "jobTitle": "Software Engineer",
    "companyName": "NBCUniversal",
    "status": 2,
    "dateApplied": "2024-07-12T05:11:08",
    "jobDescription": "",
    "notes": "",
    "minSalary": 0,
    "maxSalary": 0,
    "postingUrl": null,
    "hiringTeam": null,
    "techStack": []
  },
  {
    "id": 63,
    "jobTitle": "Full Stack Software Engineer, Core and Monetization",
    "companyName": "Pinterest",
    "status": 0,
    "dateApplied": "2024-07-16T00:00:00",
    "jobDescription": "https://www.pinterestcareers.com/jobs/4843547/full-stack-software-engineer-core-and-monetization/?gh_jid=4843547\nAbout Pinterest:\n\nMillions of people across the world come to Pinterest to find new ideas every day. It’s where they get inspiration, dream about new possibilities and plan for what matters most. Our mission is to help those people find their inspiration and create a life they love. In your role, you’ll be challenged to take on work that upholds this mission and pushes Pinterest forward. You’ll grow as a person and leader in your field, all the while helping Pinners make their lives better in the positive corner of the internet.\n\nCreating a life you love also means finding a career that celebrates the unique perspectives and experiences that you bring. As you read through the expectations of the position, consider how your skills and experiences may complement the responsibilities of the role. We encourage you to think through your relevant and transferable skills from prior experiences.\n\nOur new progressive work model is called PinFlex, a term that’s uniquely Pinterest to describe our flexible approach to living and working. Visit our PinFlex landing page to learn more.\n\nWe are looking for inquisitive, well-rounded Full-stack engineers to join our engineering teams. Working closely with product managers, designers, and backend engineers, you’ll play an important role in enabling the newest technologies and experiences. You will build robust frameworks & features. You will empower both developers and Pinners alike. You’ll have the opportunity to find creative solutions to thought-provoking problems. Even better, because we covet the kind of courageous thinking that’s required in order for big bets and smart risks to pay off, you’ll be invited to create and drive new initiatives, seeing them from inception through to technical design, implementation, and release.\n\nWhat you’ll do:\n\nBuild out full-stack Pinner-facing features to power the future of inspiration on Pinterest\nContribute to and lead each step of the product development process, from ideation to implementation to release; from rapidly prototyping, running A/B tests, to architecting and building solutions that can scale to support millions of users\nPartner with design, product, and backend teams to build end-to-end functionality\nPut on your Pinner hat to suggest new product ideas and features\nEmploy automated testing to build features with a high degree of technical quality, taking responsibility for the components and features you develop\nGrow as an engineer by working with world-class peers on varied and high impact projects\nWhat we’re looking for:\n\n3+ years of industry full-stack development experience, building consumer or business facing products\nProficiency in one or more common backend and frontend tech stacks: e.g. Javascript, React, API, storage, caching and data processing.\nExperience in following best practices in writing reliable and maintainable code that may be used by many other engineers\nAbility to keep up-to-date with new technologies to understand what should be incorporated\nStrong collaboration and communication skills\nFull-stack Monetization Engineering teams:\n\nGrowth Activation\n\nMeasurement Foundation\n\nThis position is not eligible for relocation assistance.\n\nAt Pinterest we believe the workplace should be equitable, inclusive, and inspiring for every employee. In an effort to provide greater transparency, we are sharing the base salary range for this position. This position will pay a base salary of $145,700 to $258,700. The position is also eligible for equity. Final salary is based on a number of factors including location, travel, relevant prior experience, or particular skills and expertise.\n\nInformation regarding the culture at Pinterest and benefits available for this position can be found at https://www.pinterestcareers.com/pinterest-life/.",
    "notes": "",
    "minSalary": 145700,
    "maxSalary": 258700,
    "postingUrl": null,
    "hiringTeam": null,
    "techStack": []
  },
  {
    "id": 64,
    "jobTitle": "Backend Software Engineer",
    "companyName": "Pinterest",
    "status": 0,
    "dateApplied": "2024-07-16T00:00:00",
    "jobDescription": "https://www.pinterestcareers.com/jobs/4813946/backend-software-engineer/?gh_jid=4813946\nAbout Pinterest:\n\nMillions of people across the world come to Pinterest to find new ideas every day. It’s where they get inspiration, dream about new possibilities and plan for what matters most. Our mission is to help those people find their inspiration and create a life they love. In your role, you’ll be challenged to take on work that upholds this mission and pushes Pinterest forward. You’ll grow as a person and leader in your field, all the while helping Pinners make their lives better in the positive corner of the internet.\n\nCreating a life you love also means finding a career that celebrates the unique perspectives and experiences that you bring. As you read through the expectations of the position, consider how your skills and experiences may complement the responsibilities of the role. We encourage you to think through your relevant and transferable skills from prior experiences.\n\nOur new progressive work model is called PinFlex, a term that’s uniquely Pinterest to describe our flexible approach to living and working. Visit our PinFlex landing page to learn more.\n\nWe are looking for inquisitive, well-rounded Backend engineers to join our Core and Monetization engineering teams. Working closely with product managers, designers, and backend engineers, you’ll play an important role in enabling the newest technologies and experiences. You will build robust frameworks & features. You will empower both developers and Pinners alike. You’ll have the opportunity to find creative solutions to thought-provoking problems. Even better, because we covet the kind of courageous thinking that’s required in order for big bets and smart risks to pay off, you’ll be invited to create and drive new initiatives, seeing them from inception through to technical design, implementation, and release.\n\nWhat you’ll do:\n\nBuild out the backend for Pinner-facing features to power the future of inspiration on Pinterest\nContribute to and lead each step of the product development process, from ideation to implementation to release; from rapidly prototyping, running A/B tests, to architecting and building solutions that can scale to support millions of users\nPartner with design, product, and backend teams to build end-to-end functionality\nPut on your Pinner hat to suggest new product ideas and features\nEmploy automated testing to build features with a high degree of technical quality, taking responsibility for the components and features you develop\nGrow as an engineer by working with world-class peers on varied and high impact projects\nWhat we’re looking for:\n\n2+ years of industry backend development experience, building consumer or business facing products\nProficiency in common backend tech stacks for RESTful API, storage, caching and data processing\nExperience in following best practices in writing reliable and maintainable code that may be used by many other engineers\nAbility to keep up-to-date with new technologies to understand what should be incorporated\nStrong collaboration and communication skills\nThis position is not eligible for relocation assistance.\n\n#LI-CL5\n\n#LI-REMOTE\n\nAt Pinterest we believe the workplace should be equitable, inclusive, and inspiring for every employee. In an effort to provide greater transparency, we are sharing the base salary range for this position. The position is also eligible for equity. Final salary is based on a number of factors including location, travel, relevant prior experience, or particular skills and expertise.\n\nInformation regarding the culture at Pinterest and benefits available for this position can be found here.\n\nUS based applicants only\n$106,113—$219,063 USD\n",
    "notes": "",
    "minSalary": 106113,
    "maxSalary": 219063,
    "postingUrl": null,
    "hiringTeam": null,
    "techStack": []
  },
  {
    "id": 65,
    "jobTitle": "Software Engineer II - .NET - (C#/Java/Microservices)",
    "companyName": "GEICO",
    "status": 0,
    "dateApplied": "2024-07-10T00:00:00",
    "jobDescription": "https://geico.wd1.myworkdayjobs.com/en-US/External/job/Software-Engineer-II---NET-----C--Java-Microservices----REMOTE_R0051540\nGEICO is seeking an experienced Engineer with a passion for building high-performance, low maintenance, zero-downtime platforms and applications.  You will help drive our insurance business transformation in a tech organization with engineering excellence as its mission within a culture of continuous improvement. \n\nOur Engineer II is a key member of the engineering staff working across the organization to provide a friction-less experience to our customers and maintain the highest standards of protection and availability. Our team thrives and succeeds in delivering high-quality technology products and services in a hyper-growth environment where priorities shift quickly. The ideal candidate has broad and deep technical knowledge, typically ranging from front-end UIs through back-end systems and all points in between. \n\nPosition Responsibilities \n\nAs an Engineer II, you will: \n\nScope, design, and build scalable, resilient distributed systems \nBuild product definition and leverage your technical skills to drive towards the right solution \nEngage in cross-functional collaboration throughout the entire software lifecycle \nParticipate in design sessions and code reviews with peers to elevate the quality of engineering across the organization \nDefine, create, and support reusable application components/patterns from a business and technology perspective \nUtilize programming languages like C#  or Javam or other object-oriented languages, SQL, and NoSQL databases, Container Orchestration services including Docker and Kubernetes, and a variety of Azure tools and services \nConsistently share best practices and improve processes within and across teams \nQualifications \n\nProgramming experience with at least one modern language such as C# or Java \nIllustrated capability to use new technologies such as Java, Python, or GO and experience with open-source technologies is a plus \nExperience within the .NET framework, Including VS Code / Visual Studio, SQL Server, ASP.NET, MVC, Web API, and REST \nAbility to excel in a fast-paced environment \nIn-depth knowledge of CS data structures and algorithms  \nUnderstanding of existing Operational Portals such as Azure Portal  \nUnderstanding of HTML-5, JavaScript/TypeScript, XML, and JSON  \nUnderstanding of micro-services oriented architecture and extensible REST APIs \nUnderstanding of monitoring tools    \nIntermediate PowerShell scripting skills \nExperience  \n\n2+ years of non-internship professional software development experience within the .NET framework (C# including object-oriented design)  \n 2+ years of experience with architecture and design  \n 2+ years of experience with AWS, GCP, Azure, or another cloud service  \n 2+ years of experience in open-source frameworks   \n  \n\nEducation  \n\nBachelor’s degree in Computer Science, Information Systems, or equivalent education or work experience   \n\n#LI-FA1\n\n#Dice\n\n\n \n\nAnnual Salary\n\n$76,000.00 - $157,000.00\nThe above annual salary range is a general guideline. Multiple factors are taken into consideration to arrive at the final hourly rate/ annual salary to be offered to the selected candidate. Factors include, but are not limited to, the scope and responsibilities of the role, the selected candidate’s work experience, education and training, the work location as well as market and business considerations.\n\n\n \n\nAt this time, GEICO will not sponsor a new applicant for employment authorization for this position.\n\n \n\nBenefits:\n\nAs an Associate, you’ll enjoy our Total Rewards Program* to help secure your financial future and preserve your health and well-being, including:\n\nPremier Medical, Dental and Vision Insurance with no waiting period**\nPaid Vacation, Sick and Parental Leave\n401(k) Plan\nTuition Reimbursement\nPaid Training and Licensures",
    "notes": "",
    "minSalary": 76000,
    "maxSalary": 156000,
    "postingUrl": null,
    "hiringTeam": null,
    "techStack": []
  },
  {
    "id": 66,
    "jobTitle": "Senior Engineer",
    "companyName": "GEICO",
    "status": 0,
    "dateApplied": "2024-07-08T00:00:00",
    "jobDescription": "https://geico.wd1.myworkdayjobs.com/en-US/External/job/Senior-Engineer_R0051377\nPosition Summary\n\nGEICO is seeking an experienced Engineer with a passion for building high-performance, low maintenance, zero-downtime platforms, and applications. You will help drive our insurance business transformation as we transition from a traditional IT model to a tech organization with engineering excellence as its mission, while co-creating the culture of psychological safety and continuous improvement.\n\nPosition Description\n\nOur Senior Engineer is a key member of the engineering staff working across the organization to provide a friction-less experience to our customers and maintain the highest standards of protection and availability. Our team thrives and succeeds in delivering high quality technology products and services in a hyper-growth environment where priorities shift quickly. The ideal candidate has broad and deep technical knowledge, typically ranging from front-end UIs through back-end systems and all points in between.\n\nPosition Responsibilities\n\nAs a Senior Engineer, you will:\n\nScope, design, and build scalable, resilient distributed systems\nBuild product definition and leverage your technical skills to drive towards the right solution\nEngage in cross-functional collaboration throughout the entire software lifecycle\nLead in design sessions and code reviews with peers to elevate the quality of engineering across the organization\nDefine, create, and support reusable application components/patterns from a business and technology perspective\nUtilize programming languages like Python, C# or other object-oriented languages, SQL, and NoSQL databases, Container Orchestration services including Docker and Kubernetes, and a variety of Azure tools and services\nMentor other engineers\nConsistently share best practices and improve processes within and across teams\nQualifications\n\nProgramming experience with at least two of the following technologies: C#, Java, TypeScript, JavaScript, Python, Golang  \nProven understanding of microservices oriented architecture and extensible REST APIs\nExperience architecting and designing new and current systems\nAdvanced understanding of DevOps concepts including Azure DevOps framework and tools\nAdvanced PowerShell scripting skills\nAdvanced understanding of monitoring concepts and tooling\nAdvanced understanding of security protocols and products\nExperience with continuous delivery and infrastructure as code\nIn-depth knowledge of CS data structures and algorithms\nKnowledge of developer tooling across the software development life cycle (task management, source code, building, deployment, operations, real-time communication)\nArchitecture assessment and proposals\nStrong problem-solving ability\nAbility to excel in a fast-paced environment\nExperience\n\n4+ years of professional software development experience with technologies such as C#, Java, TypeScript, JavaScript, Python, Golang, Docker, Kubernetes, and Terraform\n3+ years of experience with architecture and design\n3+ years of experience with AWS, GCP, Azure, or another cloud service\n2+ years of experience in open-source frameworks\nEducation\n\nBachelor’s degree in Computer Science, Information Systems, or equivalent education or work experience\n\n \n\nAnnual Salary\n\n$76,000.00 - $204,500.00\nThe above annual salary range is a general guideline. Multiple factors are taken into consideration to arrive at the final hourly rate/ annual salary to be offered to the selected candidate. Factors include, but are not limited to, the scope and responsibilities of the role, the selected candidate’s work experience, education and training, the work location as well as market and business considerations.\n\n\n \n\nAt this time, GEICO will not sponsor a new applicant for employment authorization for this position.\n\n \n\nBenefits:\n\nAs an Associate, you’ll enjoy our Total Rewards Program* to help secure your financial future and preserve your health and well-being, including:\n\nPremier Medical, Dental and Vision Insurance with no waiting period**\nPaid Vacation, Sick and Parental Leave\n401(k) Plan\nTuition Reimbursement\nPaid Training and Licensures",
    "notes": "",
    "minSalary": 76000,
    "maxSalary": 204500,
    "postingUrl": null,
    "hiringTeam": null,
    "techStack": []
  },
  {
    "id": 67,
    "jobTitle": "Senior Engineer - C#/.NET",
    "companyName": "GEICO",
    "status": 0,
    "dateApplied": "2023-07-08T00:00:00",
    "jobDescription": "https://geico.wd1.myworkdayjobs.com/en-US/External/job/Senior-Engineer---C--NET--REMOTE-_R0050149\nAs a Senior Engineer, you will:\n\nScope, design, and build scalable, resilient distributed systems\nBuild product definition and leverage your technical skills to drive towards the right solution\nEngage in cross-functional collaboration throughout the entire software lifecycle\nLead in design sessions and code reviews with peers to elevate the quality of engineering across the organization\nDefine, create, and support reusable application components/patterns from a business and technology perspective\nUtilize programming languages like Python, C# or other object-oriented languages, SQL, and NoSQL databases, Container Orchestration services including Docker and Kubernetes, and a variety of Azure tools and services\nMentor other engineers\nConsistently share best practices and improve processes within and across teams\nQualifications\n\nAdvanced programming experience within the .NET framework. Including C#, Visual Studio, SQL Server, ASP.NET, MVC, Web API, and REST\nProven understanding of microservices oriented architecture and extensible REST APIs\nExperience architecting and designing new and current systems\nAdvanced understanding of DevOps concepts including Azure DevOps framework and tools\nAdvanced PowerShell scripting skills\nAdvanced understanding of monitoring concepts and tooling\nAdvanced understanding of security protocols and products\nExperience with continuous delivery and infrastructure as code\nIn-depth knowledge of CS data structures and algorithms\nStrong problem-solving ability\nAbility to excel in a fast-paced environment\nKnowledge of developer tooling across the software development life cycle (task management, source code, building, deployment, operations, real-time communication)\nArchitecture assessment and proposals\nHaving Duck Creek experience is an added advantage\n#LI-KK2\n\n#DICE\n\nExperience\n\n4+ years of professional software development experience within the .NET framework (C# including object-oriented design)\n3+ years of experience with architecture and design\n3+ years of experience with AWS, GCP, Azure, or another cloud service\n2+ years of experience in open-source frameworks\nEducation\n\nBachelor’s degree in Computer Science, Information Systems, or equivalent education or work experience\n\n \n\nAnnual Salary\n\n$76,000.00 - $236,500.00\nThe above annual salary range is a general guideline. Multiple factors are taken into consideration to arrive at the final hourly rate/ annual salary to be offered to the selected candidate. Factors include, but are not limited to, the scope and responsibilities of the role, the selected candidate’s work experience, education and training, the work location as well as market and business considerations.\n\n\n \n\nAt this time, GEICO will not sponsor a new applicant for employment authorization for this position.\n\n \n\nBenefits:\n\nAs an Associate, you’ll enjoy our Total Rewards Program* to help secure your financial future and preserve your health and well-being, including:\n\nPremier Medical, Dental and Vision Insurance with no waiting period**\nPaid Vacation, Sick and Parental Leave\n401(k) Plan\nTuition Reimbursement\nPaid Training and Licensures\n",
    "notes": "",
    "minSalary": 76000,
    "maxSalary": 236500,
    "postingUrl": null,
    "hiringTeam": null,
    "techStack": []
  },
  {
    "id": 68,
    "jobTitle": "Senior Engineer - .NET",
    "companyName": "GEICO",
    "status": 0,
    "dateApplied": "2024-07-08T00:00:00",
    "jobDescription": "https://geico.wd1.myworkdayjobs.com/en-US/External/job/Senior-Engineer---NET----REMOTE-_R0050876\nPosition Description\n\nOur Senior Engineer is a key member of the engineering staff working across the organization to provide a friction-less experience to our customers and maintain the highest standards of protection and availability. Our team thrives and succeeds in delivering high quality technology products and services in a hyper-growth environment where priorities shift quickly. The ideal candidate has broad and deep technical knowledge, typically ranging from front-end UIs through back-end systems and all points in between.\n\nPosition Responsibilities\n\nAs a Senior Engineer, you will:\n\nScope, design, and build scalable, resilient distributed systems.\nBuild product definition and leverage your technical skills to drive towards the right solution.\nEngage in cross-functional collaboration throughout the entire software lifecycle.\nLead in design sessions and code reviews with peers to elevate the quality of engineering across the organization.\nDefine, create, and support reusable application components/patterns from a business and technology perspective.\nUtilize programming languages like Python, C# or other object-oriented languages, SQL, and NoSQL databases, Container Orchestration services including Docker and Kubernetes, and a variety of Azure tools and services.\nMentor other engineers.\nConsistently share best practices and improve processes within and across teams.\nQualifications\n\nAdvanced experience with C#/.NET 8, HTML-5, JavaScript/TypeScript, XML, JSON, RESTful Web Services, and Event Driven Architectures\nExperience with one additional modern language such as Java, Python, or GO and with open-source software is a plus.\nAdvanced experience within the .NET framework, Including Visual Studio, SQL Server, ASP.NET, MVC, Web API, and REST\nProven understanding of microservices oriented architecture and extensible REST APIs\nExperience architecting and designing new and current systems.\nAdvanced understanding of DevOps concepts including Azure DevOps framework and tools\nAdvanced PowerShell scripting skills\nAdvanced understanding of monitoring concepts and tooling\nAdvanced understanding of security protocols and products\nExperience with continuous delivery and infrastructure as code.\nIn-depth knowledge of CS data structures and algorithms\nStrong problem-solving ability\nAbility to excel in a fast-paced environment.\nKnowledge of developer tooling across the software development life cycle (task management, source code, building, deployment, operations, real-time communication)\nArchitecture assessment and proposals\nExperience in front-end development with React.js and its core principles.\nStrong understanding of HTML5, CSS and modern JavaScript frameworks\nExperience with state management libraries such as Redux or MobX\nKnowledge of server-side rendering (SSR) and isomorphic applications.\nExperience with common front-end development tools such as Vite, Babel, NPM etc.\nExperience with testing frameworks such as Jest, Mocha, or Cypress\nSolid understanding of responsive design, cross-browser compatibility, and performance optimization.\nExperience\n\n4+ years of professional software development experience within the .NET framework (C# including object-oriented design)\n3+ years of experience with architecture and design\n3+ years of experience with AWS, GCP, Azure, or another cloud service\n2+ years of experience in open-source frameworks\nEducation\n\n• Bachelor’s degree in Computer Science, Information Systems, or equivalent education or work experience\n\n\n \n\nAnnual Salary\n\n$76,000.00 - $185,000.00\nThe above annual salary range is a general guideline. Multiple factors are taken into consideration to arrive at the final hourly rate/ annual salary to be offered to the selected candidate. Factors include, but are not limited to, the scope and responsibilities of the role, the selected candidate’s work experience, education and training, the work location as well as market and business considerations.\n\n\n \n\nGEICO will consider sponsoring a new qualified applicant for employment authorization for this position.\n\n \n\nBenefits:\n\nAs an Associate, you’ll enjoy our Total Rewards Program* to help secure your financial future and preserve your health and well-being, including:\n\nPremier Medical, Dental and Vision Insurance with no waiting period**\nPaid Vacation, Sick and Parental Leave\n401(k) Plan\nTuition Reimbursement\nPaid Training and Licensures",
    "notes": "",
    "minSalary": 76000,
    "maxSalary": 185000,
    "postingUrl": null,
    "hiringTeam": null,
    "techStack": []
  },
  {
    "id": 69,
    "jobTitle": "Software Engineer II",
    "companyName": "Microsoft",
    "status": 0,
    "dateApplied": "2024-07-16T00:00:00",
    "jobDescription": "https://jobs.careers.microsoft.com/global/en/job/1635729\nOverview\nThe Artificial Intelligence (AI) Frameworks team at Microsoft develops AI software that enables running AI models everywhere, from the world’s fastest AI supercomputers, to servers, desktops, mobile phones, Internet of Things (IoT) devices, and internet browsers.  We collaborate with our hardware teams and hardware partners to build the software stacks for novel AI accelerators.  We work closely with Machine Learning (ML) researchers and developers to optimize and scale out model training and inference.  We are looking for a Software Engineer II to join our team!\n\n \n\nThe team operates at the intersection of AI algorithmic innovation, software, systems, and purpose-built AI hardware. We are a cross-discipline team with a collaborative and inclusive culture. We also work with and contribute back to the open-source community. \n\n \n\nAs Software Engineer II on our team, you will have the opportunity to work on the fundamental abstractions, programming models, compilers, runtimes, libraries, and Application Programming Interfaces (APIs) that enable large scale training and inferencing of the world’s most advanced AI models. \n\nQualifications\nRequired/Minimum Qualifications:  \n\nBachelor's Degree in Computer Science or related technical field AND 2+ years software engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\n1+ years experience with C/C++ \n \n\n \n\nOther Requirements:\n\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings:\n\nMicrosoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\n \n\n \n\nPreferred/Additional Qualifications: \n\n1+ years experience with Python \nA solid technical background and foundation in software engineering principles \nIntellectual curiosity and passion about learning new technologies \nExperience using and developing AI training and inference software (PyTorch, Tensorflow, Triton etc.) \nGreat cross-team collaboration skills and the desire to collaborate in a team of developers and researchers \n \n\n \n\nSoftware Engineering IC3 - The typical base pay range for this role across the U.S. is USD $94,300 - $182,600 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $120,900 - $198,600 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay\n\n \n\nMicrosoft will accept applications and processes offers for these roles on an ongoing basis.\n\n \n\n\n \n\n \n\n \n\n#aifx \n\n#AIPLATFORM#\n\n#AIPLATREF#\n\nResponsibilities\nDesign and develop AI software in C/C++, Python, and other languages. \nApply engineering principles for defining robust and maintainable architectures and designs. \nCollaborate broadly across multiple disciplines from hardware designers to ML developers. \nIdentify requirements, scope solutions, estimate work, schedule deliverables. \nHelp establish and drive the adoption of outstanding coding standards and patterns and help enhance our inclusive engineering culture. ",
    "notes": "",
    "minSalary": 94300,
    "maxSalary": 182600,
    "postingUrl": null,
    "hiringTeam": null,
    "techStack": []
  },
  {
    "id": 70,
    "jobTitle": "Software Engineer II",
    "companyName": "Microsoft",
    "status": 0,
    "dateApplied": "2024-07-16T00:00:00",
    "jobDescription": "https://jobs.careers.microsoft.com/global/en/job/1718558\nOverview\nAre you looking for an opportunity to solve business-critical problems for Fortune-500 customers globally using cutting-edge Artificial Intelligence (AI) and Machine Learning (ML) technology? Do you enjoy tackling technical challenges and producing innovative solutions to real-world problems? We are looking to hire a Software Engineer II to come join the AI Platform team in Microsoft.  You will be working along the best AI/ML engineering, science, and product talent in the industry and engaging with the largest, most complex customers and independent software vendors (ISVs) in the world. \n\n \n\nAI and ML is the explosive growth area in technology relevant to every business in every industry on the planet. The data economy is already booming with zettabytes of data generated by billions of connected devices. From these mountains of data, AI and ML will harvest valuable predictive signals and patterns that will fundamentally transform the face of business. With our own existing volumes of data and research assets, Microsoft is now a key player and a market leader in this industry.\n\n \n\nThe AI Platform organization at Microsoft has the charter to bring the best of our AI & Research assets, tools and cloud infrastructure, rich data, and trusted position together, to deliver AI and ML services and solutions to customers. The mission of the AI Customer Experience Engineering (CxE) team within the AI Platform organization is to co-innovate, incubate, and improve our core AI platform from scenarios utilizing Azure Cognitive Services like Azure OpenAI/ChatGPT, and Azure ML. We do so by building and infusing AI technologies in real world solutions and extending the signals from real world patterns to building robust, scalable AI platform services and products. To achieve this, we are co-innovating AI and ML powered solutions (rich APIs (application programming interfaces), ML models and end to end services) with our strategic ISVs and Enterprise customers, leveraging many other Azure technologies, including Azure core services and Python/C# microservices.\n\n \n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n\nIn alignment with our Microsoft values, we are committed to cultivating an inclusive work environment for all employees to positively impact our culture every day.\n\nQualifications\nRequired Qualifications\n\nBachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in C++, C#, Java or Python, OR equivalent experience.\n \n1+ years of experience working collaboratively with technical people outside your team (customers or engineers/PMs)\nPreferred Qualifications:\n\nExperience with Natural Language Processing (NLP), OpenAI GPT(Generative Pre-trained Transformer models), Azure AI Services, and Machine Learning techniques.\n3+ years of systems and services programming (C++, C# or Java)\nProven technical problem solving, software design, and implementation skills as evidenced by prior projects.\n\nSoftware Engineering IC3 - The typical base pay range for this role across the U.S. is USD $98,300 - $193,200 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $127,200 - $208,800 per year. \n\n \n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay  \n\n \n\n Microsoft will accept applications for the role until July 23, 2024.\n\n \n\n \n\n\n \n\n#AIPLATFORM\n\nResponsibilities\nWe are looking for an experienced Software Engineer II who can work across Cloud services, on-prem systems and edge hardware.\nDesigning software components and solutions, quickly learn about new services & technologies, and utilize them in the systems being designed.\nPassion for solving customer problems in a collaborative manner, desire to work on leading-edge technologies, and good communication skills.\nThe role involves a fair amount of technical leadership and customer engagement in solving complex problems with the customer/partner.\nKnowledge transfer to partners and community.\nEmbody our Culture and Values\n",
    "notes": "",
    "minSalary": 98300,
    "maxSalary": 193200,
    "postingUrl": null,
    "hiringTeam": null,
    "techStack": []
  },
  {
    "id": 71,
    "jobTitle": "Senior Software Engineer",
    "companyName": "Microsoft",
    "status": 0,
    "dateApplied": "2024-07-16T00:00:00",
    "jobDescription": "https://jobs.careers.microsoft.com/global/en/job/1702938\nOverview\nThe mission of Microsoft Digital Security & Resilience (DSR) is to enable Microsoft to build the most trusted devices and services, while keeping our company safe and our data protected. ​As part of the Microsoft Security organization, and a steward of Microsoft and our customer’s data, a core function of Microsoft DSR is ensuring the security of every aspect of the business. Microsoft DSR is responsible for company-wide information security and compliance, with a strategic focus on information protection, assessment, awareness, governance, and enterprise business continuity. As customer zero, we deploy and secure these services inside Microsoft and then share best practices with enterprise customers at scale across the globe. We have exciting opportunities for you to innovate, influence, transform, inspire and grow within our organization and we encourage you to apply to learn more!  \n\n \n\nThe Fraud Protection team is providing a platform service for our customers to protect their service from domain specific fraud vectors. We are seeking a Senior Software Engineer to join our team and help us drive the continued success of our platform.\n\n \n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n\nQualifications\nRequired/Minimum Qualifications:\n\nBachelor’s degree in computer science, or related technical discipline AND 4+ years technical engineering experience coding in C#, Java or Python\nOR equivalent work experience.\n2+ years of professional experience working with large-scale distributed systems.\nOther Requirements:\n\n \n\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings:\n\nMicrosoft Cloud Background Check: This position will be required to pass the Microsoft background and Microsoft Cloud background check upon hire/transfer and every two years thereafter.\n \n\nAdditional/Preferred Qualifications: \n\n5+ years of professional experience in the entire software development life cycle: design, development, testing, deployment, and live site support.\n2+ years experience developing solutions that are Cloud-enabled (i.e. Azure, AWS, Google).\nExperience designing/developing fraud protection related solutions.\n \n\nSoftware Engineering IC4 - The typical base pay range for this role across the U.S. is USD $112,000 - $218,400 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $145,800 - $238,600 per year.\n\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay \n\n \n\nMicrosoft will accept applications for the role until July 21st, 2024.\n\n \n\n\n \n\n#frauddetection #DistributedSystem #HighScale #DSR #MSFTSecurity\n\nResponsibilities\nDesign, write and deliver software to improve the availability, reliability, scalability, latency, security, resiliency, and efficiency of a service.\nContribute to debugging, troubleshooting complete stack of a service and drive analysis of an outage.\nEngage in service capacity planning and demand forecasting, software performance analysis and system tuning.\nReview and influence ongoing design, architecture, standards and methods for operating services and systems; assess design and code changes to drive improvements.\nConduct periodic on call duties.\n \n\nOther\n\nEmbody our Culture and Values",
    "notes": "",
    "minSalary": 11200,
    "maxSalary": 218400,
    "postingUrl": null,
    "hiringTeam": null,
    "techStack": []
  },
  {
    "id": 72,
    "jobTitle": "Software Engineer",
    "companyName": "Microsoft",
    "status": 0,
    "dateApplied": "2024-07-16T00:00:00",
    "jobDescription": "https://jobs.careers.microsoft.com/global/en/job/1737081\nOverview\nMicrosoft Silicon, Cloud Hardware, and Infrastructure Engineering (SCHIE) is the team behind Microsoft’s expanding Cloud Infrastructure and responsible for powering Microsoft’s “Intelligent Cloud” mission. SCHIE delivers the core infrastructure and foundational technologies for Microsoft's over 200 online businesses including Bing, MSN, Office 365, Xbox Live, Teams, OneDrive and the Microsoft Azure platform globally with our server and data center infrastructure, security and compliance, operations, globalization, and manageability solutions. Our focus is on smart growth, high efficiency, and delivering a trusted experience to customers and partners worldwide and we are looking for engineers to help achieve that mission. \n\n \n\nThe Cloud Hardware Analytics & Tools (CHAT) Team within SCHIE develops advanced analytical and tooling solutions to support and improve the quality of Microsoft Azure. We collect and analyze data across the full Azure stack, HW & SW components, Silicon development processes, and much more.  \n\n \n\nA candidate for this position will have development skills, collaboration and some experience working with team driven software development projects. Enterprise hardware experience is a plus. We offer an experienced team, exciting challenges, and a fun place to work. The work environment allows you to make a real impact on millions of end users. This is also a unique opportunity to work with world-class engineers. Apply now for this unique green field opportunity! \n\n \n\nWe are looking for a Software Engineer to join our team!\n\n \n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n\nQualifications\nRequired Qualifications \n\nBachelor's Degree in Computer Science, or related technical discipline with experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\nExperience with React and Web Development\n \n\nOther Requirements:\n\n \n\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings:\n\nMicrosoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter. \n \n\nPreferred Qualifications:\n\nBachelor's Degree in Computer Science or related technical field AND 1+ year(s) technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR Master's Degree in Computer Science or related technical field with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience. \n \n\nSoftware Engineering IC2 - The typical base pay range for this role across the U.S. is USD $81,900 - $160,200 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $105,600 - $174,600 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay\n\n Microsoft will accept applications for the role until July 23, 2024.\n\n \n\n\nResponsibilities\n \n\nDesign, develop and deliver internal software solutions that exceeds customer expectations.\nCollaborate with larger teams and software architects. \nSolve problems relating to mission critical services and build automation to prevent problem recurrence.\nEmbody our Culture  &  Values ",
    "notes": "",
    "minSalary": 81900,
    "maxSalary": 160200,
    "postingUrl": null,
    "hiringTeam": null,
    "techStack": []
  },
  {
    "id": 73,
    "jobTitle": "Senior Software Engineer",
    "companyName": "Microsoft",
    "status": 0,
    "dateApplied": "2024-07-16T00:00:00",
    "jobDescription": "https://jobs.careers.microsoft.com/global/en/job/1738110\nOverview\nDo you want to be at the forefront of innovating the latest hardware designs to propel Microsoft’s cloud growth? Are you seeking a unique career opportunity that combines both technical capabilities, cross team collaboration, with business insight and strategy? Join our Strategic Planning and Architecture (SPARC) team as a Senior Software Engineer within Microsoft’s Azure Hardware Systems & Infrastructure (AHSI) organization and be a part of the organization behind Microsoft’s expanding Cloud Infrastructure and responsible for powering Microsoft’s “Intelligent Cloud” mission. The SPARC organization manages Azure’s hardware roadmap from architecture concept through production for all of Microsoft’s current and future online services. \n\n \n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n\n \n\nIn alignment with our Microsoft values, we are committed to cultivating an inclusive work environment for all employees to positively impact our culture every day.\n\n \n\nQualifications\nRequired  Qualifications:\n\n \n\nBachelor's Degree in Computer Science, or related technical discipline AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\n \n\nOther Requirements\n\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check:\nThis position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\n \n\nPreferred Qualifications:\n\nBachelor's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\nWorking knowledge in computer networking, thorough understanding of transport protocols, traffic patterns, flow control, load balancing, congestion control.\nExperience with network simulation infrastructure and tools (e.g., NS3, OMNeT++, Booksim).\nFamiliarity with architecture and implementation details of network interface cards and switching hardware.\nExperience with high-performance networking, including working with NVLink, InfiniBand and/or RDMA protocols (e.g., RoCEv2, iWARP), MPI, libfabric (OFI), and collective communication libraries (e.g., NCCL, RCCL, MSCCL).\nGrowth mindset/curiosity for learning and deploying new technologies.\n \n\n \n\nSoftware Engineering IC4 - The typical base pay range for this role across the U.S. is USD $117,200 - $229,200 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $153,600 - $250,200 per year.\n\n\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay\n\n \n\nMicrosoft will accept applications for the role until August 5, 2024.\n\n \n\n\nResponsibilities\nDevelopment and evaluation of NETWORKING technologies to deliver leading-edge capabilities for Azure, focusing on delivering high throughput, low latency, reliable communication for large-scale next-gen AI systems.\nFocused on simulation-driven evaluation of advanced networking technologies covering the entire system, including topology, software, network interfaces, switches, and optimizations across all aspects of the networking stack, including transport protocol, congestion control, load balancing, failure recovery mechanisms, collective operations, and communication library implementation.\nAbility to learn and adopt relevant new technologies, tools, methods and processes from Microsoft, industry, and the research community.\nEmbody our culture and values.\n",
    "notes": "",
    "minSalary": 117200,
    "maxSalary": 229200,
    "postingUrl": null,
    "hiringTeam": null,
    "techStack": []
  },
  {
    "id": 74,
    "jobTitle": "Software Engineer II",
    "companyName": "Microsoft",
    "status": 0,
    "dateApplied": "2024-07-16T00:00:00",
    "jobDescription": "https://jobs.careers.microsoft.com/global/en/job/1738119\nOverview\nDo you want to be at the forefront of innovating the latest hardware designs to propel Microsoft’s cloud growth? Are you seeking a unique career opportunity that combines both technical capabilities, cross team collaboration, with business insight and strategy? Join our Strategic Planning and Architecture (SPARC) team as a Software Engineer II within Microsoft’s Azure Hardware Systems & Infrastructure (AHSI) organization and be a part of the organization behind Microsoft’s expanding Cloud Infrastructure and responsible for powering Microsoft’s “Intelligent Cloud” mission. The SPARC organization manages Azure’s hardware roadmap from architecture concept through production for all of Microsoft’s current and future online services. \n\n \n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n\n \n\nIn alignment with our Microsoft values, we are committed to cultivating an inclusive work environment for all employees to positively impact our culture every day.\n\n \n\nQualifications\n \n\nRequired Qualifications:\n\nBachelor's Degree in Computer Science, or related technical field AND 2+ years technical engineering experience with coding languages that involves, but is not limited to, C, C++, C#, Python, SQL, Bash, Powershell\nOR equivalent experience.\nExperience and background in system administration, and networking technologies.\n \n\n \n\nOther Requirements\n\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check:\nThis position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\n \n\n \n\nPreferred Qualifications:\n\nBackground in computer networking, thorough understanding of transport protocols.\nPast experience with high-performance networking, including working with NVLink, InfiniBand and/or RDMA protocols (e.g., RoCEv2, iWARP), MPI, libfabric (OFI)\nPast experience with FPGA-based development and hardware.\nFamiliarity with hardware development and RTL (e.g., System Verilog).\nGrowth mindset/curiosity for learning and deploying new technologies.\n \n\n \n\nSoftware Engineering IC3 - The typical base pay range for this role across the U.S. is USD $98,300 - $193,200 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $127,200 - $208,800 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay\n\nMicrosoft will accept applications for the role until August 5, 2024.\n\n \n\n \n\n\nResponsibilities\nSupporting RESEARCH LAB infrastructure and aiding in the development and evaluation of NETWORKING technologies to deliver leading-edge capabilities for Azure, focusing on delivering high throughput, low latency, reliable communication for large-scale next-gen AI systems.\nSystem administration and Software engineering skills to bring up, manage, and utilize lab infrastructure for high-performance networking experimentation that involves deployments of next-gen NICs (Network Interface Cards), network switches, custom FPGA and other networking equipment.\nAbility to learn and adopt relevant new technologies, tools, methods and processes from Microsoft, industry, and the research community.\nEmbody our culture and values.",
    "notes": "",
    "minSalary": 98300,
    "maxSalary": 193200,
    "postingUrl": null,
    "hiringTeam": null,
    "techStack": []
  },
  {
    "id": 75,
    "jobTitle": "Senior Software Engineer",
    "companyName": "Microsoft",
    "status": 0,
    "dateApplied": "2024-07-16T00:00:00",
    "jobDescription": "https://jobs.careers.microsoft.com/global/en/job/1734978\nOverview\nWe are looking to hire a Senior Software Engineer to join our team. Azure Compute is the core of our cloud platform and is growing incredibly fast.\n\n \n\nCompute is undergoing a revolution starting with Virtual Machines, containers and container orchestrator frameworks like Kubernetes and recently the “Serverless” revolution which enables developers to build powerful and scalable apps without having to deal with the complexity of operating distributed and scalable systems.\n\n \n\nAzure Functions is at the heart of Azure’s serverless platform and is the next generation of cloud compute.  It runs in more than 50 regions and already handles billions of invocations daily. We are looking for a developer to join the Azure Functions team to help design and build the next set of features that will help define how cloud native applications are built. \n\n \n\nThis is a unique opportunity to help build cutting-edge services, opportunity to do deep distributed systems development and drive strategic initiatives that are key to the overall company direction. You will have the opportunity to work on cutting edge technology including managing containers, big data, serverless all at planet scale.\n\n \n\nWe are not looking for people who know it all, we are looking for people who want to learn it all. We value the input of people who aren’t afraid to learn all the time and embrace mistakes as they continuously improve both our services and themselves. If you are excited by this type of challenge and you love to work in groups of people who are similarly excited: come join us! \n\n \n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond. \n\nQualifications\nRequired/Minimum Qualifications:\n\nBachelor's Degree in Computer Science, or related technical discipline AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\n1+ years of experience in Computer Science fundamentals in object-oriented design and data structures.\nOther Requirements:\n\n \n\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check:\n\nThis position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\nPreferred/Additional Qualifications:\n\nMaster's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\n2+ years of experience working with Linux.\n\n2+ years of experience with distributed systems and cloud services.\n\nFamiliarity with public cloud services such as Azure, AWS, or Google Cloud.\n\nDemonstrated ability to troubleshoot complex technical issues for online services.\n\nKnowledge of modern software engineering practices, including coding standards, code reviews, source control management, build processes, testing, and releasing.\n\n \n\nSoftware Engineering IC4 - The typical base pay range for this role across the U.S. is USD $117,200 - $229,200 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $153,600 - $250,200 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay\n\nMicrosoft will accept applications for the role until July 20, 2024.\n\n \n\n\nResponsibilities\nCollaborates with appropriate stakeholders to determine user requirements for a scenario.\nDrives identification of dependencies and the development of design documents for a product, application, service, or platform.\nCreates, implements, optimizes, debugs, refactors, and reuses code to establish and improve performance and maintainability, effectiveness, and return on investment (ROI).\nLeverages subject-matter expertise of product features and partners with appropriate stakeholders (e.g., project managers) to drive a workgroup's project plans, release plans, and work items.\nActs as a Designated Responsible Individual (DRI) and guides other engineers by developing and following the playbook, working on call to monitor system/product/service for degradation, downtime, or interruptions, alerting stakeholders about status and initiates actions to restore system/product/service for simple and complex problems when appropriate.\nProactively seeks new knowledge and adapts to new trends, technical solutions, and patterns that will improve the availability, reliability, efficiency, observability, and performance of products while also driving consistency in monitoring and operations at scale.\nEmbody our culture and values ",
    "notes": "",
    "minSalary": 117200,
    "maxSalary": 229200,
    "postingUrl": null,
    "hiringTeam": null,
    "techStack": []
  },
  {
    "id": 76,
    "jobTitle": "Software Engineer II",
    "companyName": "Microsoft",
    "status": 0,
    "dateApplied": "2024-07-16T00:00:00",
    "jobDescription": "https://jobs.careers.microsoft.com/global/en/job/1723129\nOverview\nMicrosoft is a company where passionate innovators come to collaborate, envision what can be and take their careers further. This is a world of more possibilities, more innovation, more openness, and the sky is the limit thinking in a cloud-enabled world. \n \nMicrosoft’s Azure Data engineering team is leading the transformation of analytics in the world of data with products like databases, data integration, big data analytics, messaging & real-time analytics, and business intelligence. The products our portfolio include Microsoft Fabric, Azure SQL DB, Azure Cosmos DB, Azure PostgreSQL, Azure Data Factory, Azure Synapse Analytics, Azure Service Bus, Azure Event Grid, and Power BI. Our mission is to build the data platform for the age of AI, powering a new class of data-first applications and driving a data culture. \n\n \n\nWithin Azure Data, the business intelligence team builds and maintains Power BI which is the undisputed leader in BI tool in the industry today and serves as the bridge between data professionals & Office users. Power BI’s core value proposition is to enable end users to get answers & insights from their data through data visualization. \n\n \n\nWe’re looking for proficient Software Engineer II to develop amazing end-to-end features across Power BI's web and desktop application, to make Power BI ubiquitous and enable our customers to extract the full value of their data. You will solve hard problems of creating AI assisted user experiences, running and maintaining a distributed system for Power BI hiding this complexity behind easy to use and intuitive experiences. You’ll help build and operate services with world-class availability, performance, and scalability. You will deliver modern user interfaces that are performant, reliable, secure, responsive, and accessible. \n\n \n\nWe do not just value differences or different perspectives. We seek them out and invite them in so we can tap into the collective power of everyone in the company. As a result, our customers are better served. \n\n \n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n\nQualifications\nRequired/Minimum Qualifications \n\nBachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python \nOR equivalent experience. \nOther Requirements \n\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: \n\nThis position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter. \nPreferred/Additional Qualifications \n\nBachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python \nOR Master's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python \nOR equivalent experience. \nExperience working with distributed systems is preferred. \n1+ years of experience with creating responsive and accessible UI using TypeScript, Angular, RxJs, or equivalent \nTechnical problem solving and debugging experience. \nFamiliarity with database technologies such as SQL server (or equivalent) \nExperience creating and consuming REST APIs. \nSoftware Engineering IC3 - The typical base pay range for this role across the U.S. is USD $98,300 - $193,200 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $127,200 - $208,800 per year.\n  \nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay\n  \nMicrosoft will accept applications for the role until July 20, 2024. \n \n\n\n \n\n#azdat #azuredata #powerbi \n\nResponsibilities\nDeliver world-class user experiences and cloud services at scale to customers in collaboration with architects, UX designers, and product managers.  \nDesign, deliver, test, monitor and support features with good quality, maintainability, and end to end ownership. \nMaintain customer focus, considering current and future needs when designing and implementing features.  \nCollaborate effectively within the team and with partner teams across Microsoft. \nContribute to a culture of excellence, inclusion, collaboration, and customer focus.\nEmbody our culture and values ",
    "notes": "",
    "minSalary": 98300,
    "maxSalary": 193200,
    "postingUrl": null,
    "hiringTeam": null,
    "techStack": []
  },
  {
    "id": 77,
    "jobTitle": "Software Engineer II",
    "companyName": "Microsoft",
    "status": 0,
    "dateApplied": "2024-07-16T00:00:00",
    "jobDescription": "https://jobs.careers.microsoft.com/global/en/job/1736591\nOverview\nAre you a customer-obsessed, AI-curious problem-solver who thrives in an inclusive, collaborative global team? The Azure CXP team’s mission is to transform Microsoft Cloud customers into fans. Through our deep engineering engagements with customers and teams across Microsoft, we analyze and amplify customer needs and drive the vision to improve Cloud quality, security, and reliability. Our culture of growth mindset and empowerment are central to who we are and how we work.\n\nAs the scale of Microsoft services continues to grow, keeping the infrastructure and cloud services running at massive scale requires non-trivial effort. Automation is the only sustainable way to do this. Hundreds of Microsoft engineers and teams use our service to automate diagnosis, root causing and remediation of live site issues. Our service eliminates manual toil, improves productivity, reduces mean time to resolve (MTTR), and helps engineers sleep at night.\n\nThe focus for our team is to add a Software Engineer II to our team to build cross-cloud products to provide our customers with world-class support and troubleshooting experiences. Our top-level objectives include winning customer satisfaction by providing the help they need and reducing customer pain time. We believe in living the core Microsoft values of Respect, Integrity, and Accountability. We are fast a growing, and dynamic team with a lot of opportunities for career growth.\n\nEvery day, our customers stake their business and reputation on our cloud. You can help Azure CXP provide our customers with the world-class cloud services they need to succeed.\n\nMicrosoft's mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n\nIn alignment with our Microsoft values, we are committed to cultivating an inclusive work environment for all employees to positively impact our culture every day.\n\nQualifications\nRequired Qualifications:\n\nBachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\n OR equivalent experience.\n \n\nPreferred Qualifications:\n\nA committed track record of shipping high quality products or services.\nExperience building and shipping distributed web services.\nExperience with one or more cloud platforms (e.g., Azure, AWS, etc.)\nExperience in C# or Java.\n2+ Years of development experience.\nReviews work items to deepen knowledge of product features in partnership with appropriate stakeholders (e.g., project managers) and executes project plans, release plans, and work items. Contributes to efforts to break down larger work items into smaller work items and provides estimation. Escalates any issues that would cause a delay.\nConducts and creates experimentation to determine the effectiveness of changes for prototyping and testing features, and applies findings back into development.\nLearns about and supports deployment to customers following the correct measures to push features out to customers. Learns about and considers the impact of build deployments on both users and other services. Learns about best practices for the deployment of features safely.\nCreates and implements code for a product, service, or feature, reusing code as applicable. Writes and learns to create code that is extensible and maintainable. Considers diagnosability, reliability, and maintainability with few defects, and understands when the code is ready to be shared and delivered. Applies coding patterns and best practices to write code.\nSupports efforts to apply debugging tools and examines logs, telemetry, and other methods to verify assumptions proactively before issues occur and reactively as issues occur for product features. Conducts retrospective debugging of solutions to identify root causes of problems.\nSoftware Engineering IC3 - The typical base pay range for this role across the U.S. is USD $98,300 - $193,200 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $127,200 - $208,800 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay\n\nMicrosoft will accept applications for the role until August 2, 2024. \n\n\n \n\n\n \n\nResponsibilities\nWe're looking for a Software Engineer II who will be working with appropriate stakeholders (e.g., project manager, technical lead) to determine user requirements for a set of features.\n\nWe are looking for a Software Engineer II who is a self-starter and likes to learn every day. As a member of our team, you will participate in all stages of our engineering life cycle - from initial research and discovery, quick iteration on promising concepts, solution prototyping, designing, and delivering features end to end - including system architecture, code, deployment, scale, performance, and quality, all the way through successful service rollout and live site support. You will have ample opportunities and scope to demonstrate your technical abilities.\n\n \n\nOther \n\nEmbody our Culture and Values ",
    "notes": "",
    "minSalary": 98300,
    "maxSalary": 193200,
    "postingUrl": null,
    "hiringTeam": null,
    "techStack": []
  },
  {
    "id": 78,
    "jobTitle": "Software Engineer",
    "companyName": "Microsoft",
    "status": 2,
    "dateApplied": "2024-07-16T00:00:00",
    "jobDescription": "Overview\nMicrosoft is a company where passionate innovators come to collaborate, envision what can be and take their careers further. This is a world of more possibilities, more innovation, more openness, and the sky is the limit thinking in a cloud-enabled world.\n\nMicrosoft’s Azure Data engineering team is leading the transformation of analytics in the world of data with products like databases, data integration, big data analytics, messaging & real-time analytics, and business intelligence. The products our portfolio include Microsoft Fabric, Azure SQL DB, Azure Cosmos DB, Azure PostgreSQL, Azure Data Factory, Azure Synapse Analytics, Azure Service Bus, Azure Event Grid, and Power BI. Our mission is to build the data platform for the age of AI, powering a new class of data-first applications and driving a data culture.\n\n \n\nWithin Azure Data, the databases team builds and maintains Microsoft's operational Database systems. We store and manage data in a structured way to enable multitude of applications across various industries. We are on a journey to enable developer friendly, mission-critical, AI enabled operational Databases across relational, non-relational and OSS offerings.\n\n \n\nThe SQL Database team delivers world class relational database server technologies used across the globe on everything from small devices, desktops, and servers to some of the largest Cloud deployments in the world. Everywhere you look, the amount of data being generated in the world is soaring. With this dramatic growth, the importance of the data platform continues to grow tremendously. Data is at the heart of the Cloud.\n\nWe are hiring a Software Engineer for the Azure SQL Database team, you will have the opportunity to design and build a massively scalable database system, focusing on highly performant multi-tier storage services and compute services. Our engineers incorporate the latest academic research and leverage the benefits of modern hardware advancements to support some of the largest databases on the planet, combining query performance with ease of management to delight customers.\n\nYou will be working in a diverse, geographically distributed team environment where collaboration and innovation are valued. You will have an opportunity for direct impact on design, functionality, performance, scalability, manageability, and supportability of the Azure SQL Database service. Join us to help us advance the state of the art in Database Systems.\n\n\nWe do not just value differences or different perspectives. We seek them out and invite them in so we can tap into the collective power of everyone in the company. As a result, our customers are better served. \n\n \n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond\n\nQualifications\nRequired/Minimum Qualifications\n\nBachelor's Degree in Computer Science, or related technical discipline with\nproven experience coding in languages including, but not limited to, C, C++, C#,\nJava, JavaScript, or Python\nOR equivalent experience.\nOther Requirements \n\n \n\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check:\n\nThis position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\nPreferred/Additional Qualifications\n\nExperience with relational database internals and storage systems\nExperience with large scale distributed systems, multithreading and object-oriented programming\nProven experience in improving product quality and reliability.\nGood knowledge in the software release process and automation.\nTorch bearer for good engineering practices such as specs, code reviews, root cause analysis processes\nProficiency in C# and/or C++ troubleshooting and debugging, multithreading and high-performance backend systems.\nSoftware Engineering IC2 - The typical base pay range for this role across the U.S. is USD $81,900 - $160,200 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $105,600 - $174,600 per year.\n\n \n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here:\n\nhttps://careers.microsoft.com/us/en/us-corporate-pay\n\n \n\nMicrosoft will accept applications for the role until June 17, 2024\n\n \n\n\n \n\n#azdat #azuredata\n\nResponsibilities\nCollaborate with appropriate stakeholders to determine user requirements and incorporate them in future designs.\nDesign and produce extensible and maintainable code.\nShare the responsibility for the health and quality of owned components; provide root cause analysis, define and deliver repair items, and ensure that code is ready for production.\nMaintain operations of live service as issues arise on a rotational, on-call basis.\nOther\n\nEmbody our culture and values",
    "notes": "",
    "minSalary": 81900,
    "maxSalary": 160200,
    "postingUrl": "https://jobs.careers.microsoft.com/global/en/job/1738214",
    "hiringTeam": null,
    "techStack": []
  },
  {
    "id": 79,
    "jobTitle": "Senior Software Engineer",
    "companyName": "Microsoft",
    "status": 0,
    "dateApplied": "2024-07-16T00:00:00",
    "jobDescription": "https://jobs.careers.microsoft.com/global/en/job/1725163\nOverview\nMicrosoft is a company where passionate innovators come to collaborate, envision what can be and take their careers further. This is a world of more possibilities, more innovation, more openness, and the sky is the limit thinking in a cloud-enabled world.\n\n \n\nAzure AI Translator’s mission is to break language barriers with world class translation AI technologies! Our translator services and apps translate text instantly or in batches across more than 100 languages, powered by the latest innovations in machine translation, supporting a wide range of use cases, such as translation of web pages, user posting, documents or any written content.\n\n \n\nAzure AI Translator is powering many Microsoft products such as Edge Browser (web page translation), Microsoft Office (document translation), Teams (caption and transcription translation), it’s also used extensively for localization of Microsoft products. As part of Azure AI services, AI translator services also power many external customers and scenarios with fast growth.\n\n \n\nWe are looking for a Senior Software Engineer eager to build cloud services that deliver the latest advances in machine translation to end-users.\n\n \n\nYou’ll be joining a small, agile team focused on APIs and services that expose translation capabilities to client applications as well as working with the latest versions of .NET and C# developing micro-services that run on Kubernetes clusters in Azure. You’ll, also, have the opportunity to take features from design to production and be involved with all engineering aspects of running a large cloud service on a global scale.\n\n \n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n\n \n\nIn alignment with our Microsoft values, we are committed to cultivating an inclusive work environment for all employees to positively impact our culture every day.\n\n \n\n \n\nQualifications\nRequired/Minimum Qualifications\n\nBachelor's Degree in Computer Science, or related technical discipline AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\n4+ years of software development experience in distributed systems and .NET  .\nOther Requirements\n\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check:\nThis position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\nAdditional or Preferred Qualifications:\n\n \n\nWrite clean, well-tested code, designed to work at scale.\nAbility to manage competing priorities and schedules.\nDemonstrated problem-solving skills.\nKnowledge of Docker, Kubernetes, Linux, micro-services.\nSoftware Engineering IC4 - The typical base pay range for this role across the U.S. is USD $117,200 - $229,200 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $153,600 - $250,200 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here:\n\nhttps://careers.microsoft.com/us/en/us-corporate-pay .\n\nMicrosoft will accept applications for the role until July 17, 2024.\n\n \n\n\n \n\nResponsibilities\nAs a Senior Software Engineer, you will:\n\nDesign, develop, test and deploy new features working across the full stack from REST APIs to backend.\nShare responsibilities to operate the Translator service.\nAnalyze existing systems to improve performance, scalability, and reliability of the service.\nEmbody our culture and values",
    "notes": "",
    "minSalary": 117200,
    "maxSalary": 229200,
    "postingUrl": null,
    "hiringTeam": null,
    "techStack": []
  },
  {
    "id": 80,
    "jobTitle": "Software Engineer II - Full Stack",
    "companyName": "Microsoft",
    "status": 0,
    "dateApplied": "2024-07-16T00:00:00",
    "jobDescription": "https://jobs.careers.microsoft.com/global/en/job/1738116\nOverview\nMicrosoft is a company where passionate innovators come to collaborate, envision what can be and take their careers further. This is a world of more possibilities, more innovation, more openness, and the sky-is-the-limit thinking in a cloud-enabled world. \n \nMicrosoft’s Azure Data engineering team is leading the transformation of analytics in the world of data with products like databases, data integration, big data analytics, messaging & real-time analytics, and business intelligence. The products our portfolio include Microsoft Fabric, Azure SQL DB, Azure Cosmos DB, Azure PostgreSQL, Azure Data Factory, Azure Synapse Analytics, Azure Service Bus, Azure Event Grid, and Power BI. Our mission is to build the data platform for the age of AI, powering a new class of data-first applications and driving a data culture. \n\n \n\n​​Within Azure Data, the databases team builds and maintains Microsoft's operational Database systems. We store and manage data in a structured way to enable multitude of applications across various industries. We are on a journey to enable developer friendly, mission-critical, AI enabled operational Databases across relational, non-relational and OSS offerings.​ \n\n​​The world is producing and storing more data than ever before. How would you like to join the Azure SQL team to keep that data safe and efficient? \n\n \n\nWe are looking for a Software Engineer II - Full Stack.\n\n \nIn the cloud-based world, running our Azure service reliably and efficiently is key to Microsoft's growth and future. Azure SQL is one of the biggest services hosted by Azure. Together we build on Azure's phenomenal growth and success. We are building trustworthy telemetry infrastructure and analytics to help us keep the service running smoothly, prevent and reduce outages and increase customer satisfaction. In constantly improving our scalability, reliability and security, we aim to monitor our large scale service in real time, reduce noise in the system and have auto tuning solutions and self-remediation via bots. We are building intelligent and smart diagnostics infrastructure to auto detect and fix problems that our customers face with their Azure resources. It involves building large scale low latency distributed service, building framework for adding diagnostics to make inferences, and using intelligence to predict problems. The goal is to build services that delights our customers, solves their problems as quickly as possible and prevent them proactively. We collaborate with data scientists on innovative solutions to improve customer experience with Azure SQL by leveraging this telemetry data and pipeline in new ways.\n\n​​ \n\nWe do not just value differences or different perspectives. We seek them out and invite them in so we can tap into the collective power of everyone in the company. As a result, our customers are better served. \n\n \n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond. \n\nQualifications\nRequired/Minimum Qualifications \n\n​​Bachelor’s degree in Computer Science or Engineering or Mathematics or Statistics or Physics and 2+ years of industry software engineering experience writing code in Java, C++, C#, or C or other object-oriented programming language​ \nOR equivalent experience\nOther Requirements \n\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: \n\nThis position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter. \n \n\nPreferred Qualifications\n\nBachelor’s degree in Computer Science or Engineering or Mathematics or Statistics or Physics and 4+ years of industry software engineering experience writing code in Java, C++, C#, or C or other object-oriented programming language​\nOR Masters Degree in Computer Science or Engineering or Mathematics or Statistics or Physics and 2+ years of industry software engineering experience writing code in Java, C++, C#, or C or other object-oriented programming language\nOR equivalent experience​\nCuriosity and willingness to question\nEnthusiasm, integrity, ingenuity, results-orientation, self-motivation, and resourcefulness in a fast-paced environment\nExperience in database and data warehouse application design and development\nExperience developing and managing scalable cloud services\nCommunication and collaboration skills with proven technical leadership skills\nData engineering experience in operationalizing data science model or building data engineering pipeline is a plus\nSoftware Engineering IC3 - The typical base pay range for this role across the U.S. is USD $98,300 - $193,200 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $127,200 - $208,800 per year.\n  \nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https: https://careers.microsoft.com/us/en/us-corporate-pay\n   \n  \nMicrosoft will accept applications for the role until August 2, 2024. \n \n\n\n \n\n#azdata #azuredata \n\nResponsibilities\n​​This is a position with opportunity for high visibility projects across Azure SQL and high impact in increasing service scalability. We are a tight-knit team who values diversity, collaboration and learning from each other. We are committed to being data driven, agile and continuously improving customer experience.  We want to truly understand customer requirements and deliver solutions that not only satisfy their needs but exceed their expectations.  If that sounds like the right environment for you, please join us!​ \n\n \n\nEmbody our culture and values ",
    "notes": "",
    "minSalary": 98300,
    "maxSalary": 193200,
    "postingUrl": null,
    "hiringTeam": null,
    "techStack": []
  },
  {
    "id": 81,
    "jobTitle": "Software Engineer",
    "companyName": "Microsoft",
    "status": 0,
    "dateApplied": "2024-07-16T00:00:00",
    "jobDescription": "https://jobs.careers.microsoft.com/global/en/job/1736578\nOverview\nMicrosoft is looking for a Software Engineer. SONiC team owns all the software that is running on the switches and routers. We have lots of interesting problems to solve, such as supporting new generation switches ranging from 10G/40G to 100G/400G/800G, adding packet forwarding features, providing extensive telemetry data for the switches, and designing features for smartswitch. The SW team works on all the stages of network switches, from defining new switch requirements, to hardware/software design, getting the latest Linux kernel for our switch platforms and supporting them in operations. The team is also building vibrant open-source community for the switch software, which is adopted by various other cloud providers.\n\n \n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n\nQualifications\nRequired Qualifications:\n\nBachelor's Degree in Computer Science, Electric Engineering, or related technical discipline with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience\nOther Requirements:\n\n \n\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: \nMicrosoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.\n \n\nPreferred Qualifications:\n\nExperience delivering commercial software\nBachelor's Degree in Computer Science or related technical field AND 1+ year(s) technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR Master's Degree in Computer Science or related technical field with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\nSoftware Engineering IC2 - The typical base pay range for this role across the U.S. is USD $81,900 - $160,200 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $105,600 - $174,600 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay\n\nMicrosoft will accept applications for the role until August 11, 2024.\n\n\n \n\n\n \n\n#azurecorejobs\n\nResponsibilities\nDesign and implement platform services such as programming, monitoring, and controlling system components like the transceivers/optics, Smart-cable, PHY, FPGAs, sensors, fan control power etc.\nDesign and implement kernel device drivers and platform services\nOwn workstreams focused on hardware bringup, port bringup, platform services bringup, and lead the cross-functional effort for validation of new switches\nDebugging and analyze/profile performance problems\nDebug complex, system-level, multi-component issues that typically span across multiple layers from Kernel, and user-mode applications\nDevelop robust unit test framework to test newly added functionality or hardware capability\nWork with network engineers to support Azure production network\nOther\n\nEmbody our Culture and Values",
    "notes": "",
    "minSalary": 81900,
    "maxSalary": 160200,
    "postingUrl": null,
    "hiringTeam": null,
    "techStack": []
  },
  {
    "id": 82,
    "jobTitle": "Software Engineer",
    "companyName": "Microsoft",
    "status": 2,
    "dateApplied": "2023-07-16T00:00:00",
    "jobDescription": "Overview\nMicrosoft is a company where passionate innovators come to collaborate, envision what can be and take their careers further. This is a world of more possibilities, more innovation, more openness, and the sky is the limit thinking in a cloud-enabled world. \n\n\nMicrosoft’s Azure Data engineering team is leading the transformation of analytics in the world of data with products like databases, data integration, big data analytics, messaging & real-time analytics, and business intelligence. The products our portfolio include Microsoft Fabric, Azure SQL DB, Azure Cosmos DB, Azure PostgreSQL, Azure Data Factory, Azure Synapse Analytics, Azure Service Bus, Azure Event Grid, and Power BI. Our mission is to build the data platform for the age of AI, powering a new class of data-first applications and driving a data culture. \n\n \n\n​​Within Azure Data, the databases team builds and maintains Microsoft's operational Database systems. We store and manage data in a structured way to enable multitude of applications across various industries. We are on a journey to enable developer friendly, mission-critical, AI enabled operational Databases across relational, non-relational and OSS offerings.​\n\n \n\n​​We are looking for a Software Engineer who will primary be working on the SQL Azure Backup Restore Service. You will work to bring more capabilities and to enhance multiple features within the SQL Azure Backup Restore Service, define and design next generation of technologies to build a scalable, reliable and efficient backup restore solution. \n\n \n\n​​We do not just value differences or different perspectives. We seek them out and invite them in so we can tap into the collective power of everyone in the company. As a result, our customers are better served. \n\n \n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n\n \n\nIn alignment with our Microsoft values, we are committed to cultivating an inclusive work environment for all employees to positively impact our culture every day.\n\nQualifications\nRequired Qualifications: \n\n​​Bachelor's degree in computer science, or related technical discipline with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python                                                                                                                                                                               OR equivalent experience.\nProficiency in C, C++, troubleshooting and debugging multithreaded and high-performance backend systems.​ \n \n\nOther Requirements:\n\n \n\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter. \n \n\n Preferred Qualifications:\n\nBachelor's Degree in Computer Science or related technical field AND 2+ year(s) technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Pythono\nOR Master's Degree in Computer Science or related technical field with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.​ \nSoftware Engineering IC2 - The typical base pay range for this role across the U.S. is USD $81,900 - $160,200 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $105,600 - $174,600 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here:\n\nhttps://careers.microsoft.com/us/en/us-corporate-pay\n\n\n\nMicrosoft will accept applications for the role until July 17, 2024.\n\n\n \n\n \n\n#azdat \n\n#azuredata \n\n​​#dataintegration​  \n\nResponsibilities\nIn this role, you will be an individual contributor, working with a team of engineers to design, implement and maintain features in the Backup Restore Service that will benefit millions of databases on Azure SQL  \nYou will have the opportunity to define and design next generation of SQL Azure Backup Restore Service, and opportunity to develop system design skills. \nCollaboration with stakeholders, disciplines and architects to deliver timely products to our partners and customers\nDevelop and maintain high-quality code, documentation and specifications\nParticipate in design discussions, code reviews and architecture discussions.\nDemonstrate and develop effective communication and group collaboration skills​ \nOther:\n\nEmbody our Culture and Values",
    "notes": "",
    "minSalary": 81900,
    "maxSalary": 160200,
    "postingUrl": "https://jobs.careers.microsoft.com/global/en/job/1737007",
    "hiringTeam": null,
    "techStack": []
  },
  {
    "id": 83,
    "jobTitle": "Software Engineer",
    "companyName": "Microsoft",
    "status": 0,
    "dateApplied": "2024-07-16T00:00:00",
    "jobDescription": "https://jobs.careers.microsoft.com/global/en/job/1732547\nOverview\nThe Gaming Devices + Artificial Intelligence Engineering team is a team of diverse and exceptionally creative professionals who design, test and manufacture some of the best-loved gaming devices in the world. Our teams ship tens of millions of hardware products every year including the Xbox Series S, Xbox Series X, a full accessories lineup, and more. Come be part of what’s next for the future of gaming! \n\nAs a Software Engineer in the Gaming Devices + AI Engineering team, you will be developing automation and test tooling for the next generation of Gaming Hardware. By combining Cloud services with IoT Edge and Artificial Intelligence Edge systems, you will create the next generation of scalable, extensible, and secure HW Qualification solutions used within Xbox and other teams. You will build skills in a breadth of technologies, stay at the forefront of industry hardware, and engage with all aspects of gaming to make a truly immersive experience for all our gaming family and customers. \n\n \n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond. \n\nQualifications\nRequired/Minimum Qualifications\n\n \n\n· Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\n\n \n\no OR equivalent experience.\n\n \n\nOther Requirements:\n\n \n\nThis position requires verification of citizenship due to citizenship-based legal restrictions. Specifically, this position supports United States federal, state, and/or local government agency customers and is subject to certain citizenship-based restrictions where required or permitted by applicable law. To meet this legal requirement, and as a condition of employment, the successful candidate’s citizenship will be verified with a valid passport.\n\n \n\nAbility to meet Microsoft, costumer and/or government security screening requirements are required for this role. These requirements include, but not limited to, the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/tranter and every two years thereafter.\n\n \n\n \n\nAdditional or Preferred Qualifications\n\n \n\n· Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\n\n \n\no OR Master's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\n\n \n\no OR equivalent experience.\n\n  \n\nSoftware Engineering IC3 - The typical base pay range for this role across the U.S. is USD $98,300 - $193,200 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $127,200 - $208,800 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay\n\n• Microsoft will accept applications for the role until July 23, 2024.\n\n\n \n\n\nResponsibilities\nThe Xbox Device Validation Team is seeking a Software Engineer with a systems and firmware background to join our Services and Operations Group. This group is responsible for end-to-end execution service, engineering processes, and SW tools for the org. As such, you will be engaged with the entire team with exposure to all levels of technology from firmware to test apps to reporting and data analytics. This is a great opportunity for a team player who wants to collaborate across disciplines with an always learning approach, who enjoys working on a variety of solutions from all levels of technology, and who can look at  problems as just another thing we haven’t looked at yet.  \n\n \n\nJoining our team, you can expect to: \n\nCollaborate with hardware and firmware development teams to create validation tools for Xbox console and accessory hardware and firmware. \nBuild end-to-end automation to validate Xbox console and accessory hardware and firmware from infrastructure to test execution to reporting. \nAnalyze effectiveness of existing Windows-based test apps and develop new ones as needed. \nContribute to the development of test design and test infrastructure including new Artificial Intelligence analytic models. \nParticipate actively in bug/issue triage with the feature teams. \nOther\n\nEmbody our Culture  &  Values ",
    "notes": "",
    "minSalary": 98300,
    "maxSalary": 193200,
    "postingUrl": null,
    "hiringTeam": null,
    "techStack": []
  },
  {
    "id": 84,
    "jobTitle": "Software Engineer II",
    "companyName": "Microsoft",
    "status": 0,
    "dateApplied": "2024-07-16T00:00:00",
    "jobDescription": "https://jobs.careers.microsoft.com/global/en/job/1733108\nOverview\nAre you ready to join an exciting and dynamic team of engineers? If so, Microsoft's Cloud Operations + Innovation team is looking to hire a Software Engineer II.\n \nMicrosoft’s Cloud Operations and Innovation (CO+I) team builds and operates Microsoft datacenters, which in turn power Microsoft’s cloud business. The CO+I Engineering team (CO+IE) delivers services, applications, and automation supporting datacenter planning, construction, and operation. We own a large portfolio of services, including workflows that enable predicable, lowest cost datacenter construction, telemetry systems that drive high availability and optimized energy usage, and task and performance management applications that help our operation run as efficiently as possible. CO+I Engineering is a competitive advantage for Microsoft, and an important pillar in its cloud success.\n\n \n\nSovereign Cloud Engineering (SCE) team develops apps and services to enable sovereign cloud datacenter operations that are scalable, effective, compliant, cost-efficient, and intelligent, so it reliably provides computation capacity for Microsoft clouds and services such as Azure, Microsoft 365, and Dynamics 365. We are looking for a passionate and self-driven Software Engineer II to work with the team and our partners to enable the next generation of data center operation with cutting edge features and technology, and make sure it matches the ever-growing cloud computation demands from existing and emerging sovereign clouds around the globe. If you enjoy driving innovation in a fast-paced engineering team, passionate about building great user experiences using the latest cutting-edge technologies, yearn to build highly scalable distributed services, working across a breadth of CO+I systems in addition to being a depth expert in one or more of those systems, this is the right opportunity for you.\n\n \n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n\n \n\nIn alignment with our Microsoft values, we are committed to cultivating an inclusive work environment for all employees to positively impact our culture every day.\n\nQualifications\nRequired/Minimum Qualifications:\n\n \n\n• Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\no OR equivalent experience.\n• 1+ years working experience in software design, development, DevOps in web application and/or microservices.\n\n \n\nOther Requirements:\n\n \n\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to, the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\n\n \n\nPreferred/Additional Qualifications:\n\n \n\n• 3+ years working experience in software design, development, DevOps in web application and/or microservices.\n• Working experience in cloud-based services (Azure or AWS).\n• Working experience in modern web framework such as Angular, React, or Vue.\n• Analytical skills and an ability to abstract concepts and think in terms of OO design.\n• Data-driven mind-set. Ability to mine data and persuade your team using effective analysis.\n\n \n\nSoftware Engineering IC3 - The typical base pay range for this role across the U.S. is USD $98,300 - $193,200 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $127,200 - $208,800 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay.\n\nMicrosoft will accept applications for the role until August 7, 2024.\n\n \n\n\n \n\n#COICareers\n#COIEngCareers\n\nResponsibilities\n• Works with appropriate stakeholders to determine user requirements for a set of features.\n• Contributes to the identification of dependencies, and the development of design documents for a product area with little oversight.\n• Creates and implements code for a product, service, or feature, reusing code as applicable.\n• Contributes to efforts to break down larger work items into smaller work items and provides estimation.\n• Acts as a Designated Responsible Individual (DRI) working on-call to monitor system/product feature/service for degradation, downtime, or interruptions and gains approval to restore system/product/service for simple problems.\n• Remains current in skills by investing time and effort into staying abreast of current developments that will improve the availability, reliability, efficiency, observability, and performance of products while also driving consistency in monitoring and operations at scale.\n\n \n\nEmbody our Culture and Values ",
    "notes": "",
    "minSalary": 98300,
    "maxSalary": 193200,
    "postingUrl": null,
    "hiringTeam": null,
    "techStack": []
  },
  {
    "id": 85,
    "jobTitle": "Senior Software Engineer",
    "companyName": "Microsoft",
    "status": 0,
    "dateApplied": "2024-07-16T00:00:00",
    "jobDescription": "https://jobs.careers.microsoft.com/global/en/job/1730200\nOverview\nWe are looking to hire a Senior Software Engineer to join our team. The Azure Customer Experience Platform (CXP) team’s mission is to transform Microsoft Cloud customers into fans. Through our deep engineering engagements with customers and teams across Microsoft, we analyze and amplify customer needs and drive the vision to improve Cloud quality, security, and reliability. Our culture of growth mindset and empowerment are central to who we are and how we work. \n\n \n\nWe are customer-obsessed problem-solvers. We orchestrate deep engagements in areas like incident management, support, and enablement. We analyze and amplify those customer voices, both within our own team, and across the Cloud + Artificial Intellegence (AI) team, bringing the customer connection to the Quality vision for Azure. We innovate ways to scale what we learn across our customer base.  Diversity and inclusion are central to who we are, how we work, and what we enable our customers to achieve. We know that empowering our customers starts with empowering our team to show up authentically, work in ways that are best for them, and achieve their career goals. Azure Reliability team is a multidisciplinary engineering organization part of CXP dedicated to making, “Azure the safest and most reliable Cloud”. \n\n \n\nAzure Site Reliability Engineering (SRE) teams strive to improve reliability fundamentals via software engineering, preferring long-lasting platform improvements delivered as engineering projects over repetitive manual operations. We contribute to the product fundamentals and architecture, share knowledge, and code, and prefer reuse over re-invention, always looking for ways to make what we build useful to multiple teams and products. \n\n \n\nWe are not looking for people who know it all, we are looking for people who want to learn it all. We value the input of people who aren’t afraid to learn all the time and embrace mistakes as they continuously improve both our services and themselves. If you are excited by this type of challenge and you love to work in groups of people who are similarly excited: come join us!  \n\n \n\nEvery day, our customers stake their business and reputation on our cloud. You can help #AzCXP provide our customers with the world-class cloud services they need to succeed. \n\n \n\nThis role supports flexible work from home with occasional in-office meetings. \n\n \n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond. \n\nQualifications\nRequired/Minimum Qualifications:\n\nBachelor's Degree in Computer Science, or related technical discipline AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\nOther Requirements:\n\n \n\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check:\n\nThis position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\nPreferred/Additional Qualifications:\n\nBachelor's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\n \n\nSoftware Engineering IC4 - The typical base pay range for this role across the U.S. is USD $117,200 - $229,200 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $153,600 - $250,200 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay\n\nMicrosoft will accept applications for the role until July 18, 2024.\n\n \n\n\n \n\n#AZCXP #AzRelJobs \n\nResponsibilities\nPartner across multiple product groups to apply subject-matter expertise in distributed systems design practices, interactions between cloud technology layers and components, basic dependencies at scale, and the code that defines infrastructures. \nDevelop and evangelize insights, best practices, and standards that can be applied to improve system, platform, and/or product development and operations across the business.  \nDrive continuous improvements in the architecture, code, features, operations and comprehensive use scenarios of products by leveraging end-to-end technical expertise. \nMake improvements to the product fundamentals and architecture, share knowledge and code, always looking for ways to make what we build useful to multiple teams and products.    \nDemonstrate end-to-end expertise in distributed systems design, interactions between cloud technology layers. \nProvide technical leadership in test maturity reviews, static analysis reviews, meetings, on-call rotations, and incident responses throughout product development and operations cycles.  \nProvides deep business and technical expertise as required to resolve major incidents. \nEmbody our culture and values",
    "notes": "",
    "minSalary": 117200,
    "maxSalary": 229200,
    "postingUrl": null,
    "hiringTeam": null,
    "techStack": []
  },
  {
    "id": 86,
    "jobTitle": "Senior UIPATH Developer",
    "companyName": "WonderBotz",
    "status": 0,
    "dateApplied": "2024-07-17T00:00:00",
    "jobDescription": "https://wonderbotz.applytojob.com/apply/gMAGODqfdf/Senior-UIPATH-Developer-Hybrid-Montreal\nDescription\n\nAs a consulting company, Invoke drives business transformation through the lens of Intelligent Automation. With 4 offices spread across the globe, we've been used to remote collaboration well before 2020 forced us to be. No matter where you're working from or which team you're on, we are all working towards one goal: delivering innovative solutions and exceptional support. \n\nRole/Responsibilities:\n\nWork as a consultant to help deliver successful Robotic Process Automation (RPA) and Intelligent Automation projects \nProvide client-facing consulting, including facilitation of workshops, design sessions, and testing activities\nProvide consulting services to one or more clients, in both a remote and onsite capacity\nProvide support and share expertise with other INVOKE consultants \nMentor junior developers in the team and share knowledge of UiPath and automation development best practices.\nCollaborate with team leads to identify gaps and constraints associated with business requirements and process and aid in providing solutions to resolve the process issues\nTranslate business requirements and processes into technical requirement and configuration settings specific to Robotics Automation solutions\nEvaluate change requests to determine approach and level of effort and communicate it back to either the project team or customer\nQualifications for the ideal candidate: \n\nUniversity degree in Computer Engineering, Computer Science, Business Management, or equivalent experience is an asset\nProven programming experience (Python or C# preferred)\nStrong understanding of software engineering principles, including design patterns, data structures, and algorithms.\nExperience in end-to-end development of business processes using UiPath with ability to develop on Windows, mainframe, web-based browsers, etc\nExperience with developing reusable bot framework, RPA components, and scripts\nExperience with bot exception error handling and log errors\nExperience with UiPath Orchestrator, Robots, Studio, and other UiPath tools.\nStrong communication skills - Fluency in written and spoken English.\nTeam player \nCustomer service mindset\nDesirable:\n\nAWS and Linux experience / knowledge is a plus\nFluency in French and/or Spanish \nWonderBotz is an Equal Employment Opportunity employer.",
    "notes": "",
    "minSalary": 0,
    "maxSalary": 0,
    "postingUrl": null,
    "hiringTeam": null,
    "techStack": []
  },
  {
    "id": 87,
    "jobTitle": "UiPath Solution Architect",
    "companyName": "WonderBotz",
    "status": 0,
    "dateApplied": "2024-07-17T00:00:00",
    "jobDescription": "https://wonderbotz.applytojob.com/apply/kHKjYmMRQ9/UiPath-Solution-Architect\nDeveloper Role and Responsibilities\n\nYour specific duties will be based upon your experience as an Solution Architect. In this role, you will be responsible for designing and delivering RPA/IA solutions in accordance with WonderBotz standards and best practices. You will work closely together with our enthusiastic team of both business and technical specialists. You will be part of a fast-growing and successful team that helps our clients get the maximum benefit.\n\nExpected Activities:\n\nTake ownership of your customers' technical success with the UiPath Platform\nBe a core member of the UiPath account team for each of your customers, accountable for technical workstreams that help your customers strategize and execute adoption plans that will return exceptional business value\nProactively engage and influence your customers, providing embedded technical advisory and guiding the technical maturity of your customers' automation programs to help them achieve their objectives and elevate their line of sight as to what can be achieved\nProvide UiPath Platform infrastructure, installation and upgrade planning, guided assistance, and troubleshooting\nEnable your customers' technical stakeholders on UiPath Platform best practices relevant to their unique automation pipelines, program objectives, environments, and constraints\nConduct design and code reviews for select automations to reinforce and verify those best practices\nPerform technical health checks of your customers' automation programs and environments, identifying risks and opportunities for continuous improvement across technical disciplines\nCollaborate with UiPath Product Support and other subject matter experts to manage, facilitate, communicate, and bring to positive closure escalated support incidents\nProvide technical advisory to customers through webinars, demos, and speaking engagements\nDevelop and mature our teams’ processes, assets, and methodologies in an agile manner to continually iterate and maintain best-in-.\nQualifications and Skills\n\nA degree in Computer Science or relevant degree \nA minimum 5 years experience in programming .NET / Java applications (C#, C++, VB, Java or Powershell), SaaS and Cloud experience a benefit\nFluency in written and spoken English and Finnish is mandatory/ Any other Scandinavian languages will be considered a plus\nRelevant work experience with progressive responsibility in customer-facing, technical account management or technical consulting roles\nWork experience to credibly communicate with and guide customers on diverse technical topics, including software engineering, packaging and deployment, cloud technologies, and infrastructure engineering\nPrevious experience working with UiPath, Automation Anywhere, Blue Prism, Pega or Nice is preferred\nStrong analytical and problem-solving skills, self-motivated, proactive team player with innovative ideas to inspire customer loyalty and adoption\nDiplomacy, tact, and poise under pressure when working through customer issues. \nWillingness to travel for client interactions up to 25% of the time\nDesired characteristics in candidates\n\nEffective communication skills for technical and non-technical audiences\nAnalytical and proven problem-solving skills\nHigh Emotional IQ\nEmbraces challenges\nTeam-orientation rather than an individual contributor\nCompensation and start dates\n\nHiring now for immediate start\nSalary: Competitive base and bonus determined by level and experience\nWonderBotz is an Equal Employment Opportunity employer.\n\n",
    "notes": "",
    "minSalary": 0,
    "maxSalary": 0,
    "postingUrl": null,
    "hiringTeam": null,
    "techStack": []
  },
  {
    "id": 88,
    "jobTitle": "Software Engineer I/II",
    "companyName": "Microsoft",
    "status": 0,
    "dateApplied": "2024-07-17T00:00:00",
    "jobDescription": "Overview\nMicrosoft is a company where passionate innovators come to collaborate, envision what can be and take their careers further. This is a world of more possibilities, more innovation, more openness, and the sky is the limit thinking in a cloud-enabled world. \n \nMicrosoft’s Azure Data engineering team is leading the transformation of analytics in the world of data with products like databases, data integration, big data analytics, messaging & real-time analytics, and business intelligence. The products our portfolio include Microsoft Fabric, Azure SQL DB, Azure Cosmos DB, Azure PostgreSQL, Azure Data Factory, Azure Synapse Analytics, Azure Service Bus, Azure Event Grid, and Power BI. Our mission is to build the data platform for the age of AI, powering a new class of data-first applications and driving a data culture. \n\n \n\n​​Within Azure Data, the databases team builds and maintains Microsoft's operational Database systems. We store and manage data in a structured way to enable multitude of applications across various industries. We are on a journey to enable developer friendly, mission-critical, AI enabled operational Databases across relational, non-relational and OSS offerings.\n\n \n\n​​We are looking for a Software Engineer I/II to join the Azure SQL Database group, with a passion for technology, building high-performance mission critical systems and helping customers succeed on our platform by building industry-leading features and capabilities.  \n \nThe Azure SQL Database service has millions of databases under its management. With this unprecedented growth come exciting technical challenges at scales previously unimaginable. These problems span from a wide range of software engineering areas like core database systems (query processing, transaction processing, efficient locking, storage management), operating systems capabilities (scheduling, memory management, synchronization, resource governance), highly distributed systems (availability, geo-replication, disaster recovery, backup & restore, modern scale-out architectures), and networking systems (protocol design, SDNs, high-performance transports like RDMA).   \n \nWe seek engineers with experience in one or more of these areas who are passionate about delivering high-quality features our customers will use and love.  \n \nThis team is on a mission to define and deliver the best relational database service in the world. At your disposal there will be SQL's state-of-the-art management system, a sophisticated database engine, and terabytes of telemetry to make informed decisions. \n\n \n\n Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees, we come together with a growth mindset, innovate to empower others and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.  \n\n\nWe do not just value differences or different perspectives. We seek them out and invite them in so we can tap into the collective power of everyone in the company. As a result, our customers are better served. \n\nQualifications\nRequired/Minimum Qualifications \n\n​​​​Bachelor's Degree in Computer Science, or related technical discipline AND technical engineering experience with coding in languages including, but not limited to, C, C++, C#, or Java.  \nOR equivalent experience\n2+ years of experience designing and developing high-performance and production quality C++ or C#/Java server software.\n2+ years of experience developing backend services like storage, databases or networking systems in large distributed systems environment. ​ \nOther Requirements \n\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: \n\nThis position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter. \nPreferred/Additional Qualifications \n\n​​Bachelor's Degree in Computer Science, or related technical discipline AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, or Java.  \nOR equivalent experience.\n4+ years of experience designing and developing high-performance and production quality C++ or C#/Java server software.\nExtensive and specialized knowledge in one or more of the following areas: Database systems, Operating systems (OS) internals, Distributed Storage systems, Software Defined Networking (SDN) technologies and Cloud architecture.\nNative Windows development experience is a bonus (stack and heap management, threads, synchronization, debugging).\n2+ years of experience related to Software Engineering skills covering design/development/usage of performance workloads/test-suites/Tools to measure, analyze and root cause reliability, performance, and scalability issues in the product.\nEffective debugging, problem-solving, interpersonal, and communication skills.​ \nSoftware Engineering IC2 - The typical base pay range for this role across the U.S. is USD $81,900 - $160,200 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $105,600 - $174,600 per year.\n\n \n\nSoftware Engineering IC3 - The typical base pay range for this role across the U.S. is USD $98,300 - $193,200 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $127,200 - $208,800 per year.\n\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay\n\n \n\nMicrosoft will accept applications and processess offers for these roles on an ongoing basis.\n\n \n\n\n \n\n#azdat \n\n#azuredata \n\nResponsibilities\nAs an Software Engineer I/II you will be responsible to do the following: \n\n​​Design, code, test, and develop features that will improve the SQL DB service offerings ensuring quality, maintainability, and end-to-end ownership.\nContribute to current and future product improvements around reliability and performance of the database service.\nStrengthen the engineering process to ensure cloud deployments are done in the most efficient way and meet the targeted reliability, performance, scalability, and Service Level Agreement (SLA) goals.\nIdentify improvements in supportability and customer self-diagnostics to enhance live monitoring and address performance and reliability related issues.\nCollaborate, teach, and learn from a diverse team of world-class engineers.\nLearn our customers’ experience first-hand by participating in the on-call rotation for the service teams.\nDrive decisions with data, prioritize customer obsession, and leverage telemetry from production systems and customer usage patterns.  \nOther\n\nEmbody our Culture and Values",
    "notes": "",
    "minSalary": 81900,
    "maxSalary": 160200,
    "postingUrl": "https://jobs.careers.microsoft.com/global/en/job/1736605/Software-Engineer-I%2FII",
    "hiringTeam": null,
    "techStack": []
  },
  {
    "id": 89,
    "jobTitle": "Senior Software Engineer",
    "companyName": "Microsoft",
    "status": 2,
    "dateApplied": "2024-07-17T00:00:00",
    "jobDescription": "Overview\nWe are part of Customer Success Engineering (CSE) focused on the Small & Medium Business (SMB) segment of Experiences + Devices (E+D) Modern Work. Our mission is to drive Affinity, Awareness and Acquisition of new SMB customers, Upgrade, Expand and Retain existing SMB customers, Lead the AI and Copilot wave using world-class engineering practices. Our team culture is supportive, values continuous learning, flexibility and empowerment.\n\n \n\nOur work spans Modern Work (Productivity) as well as Identity, Security and Compliance. We build solutions that accelerate Cloud Adoption, Tenant Migration, Tenant Health in collaboration with teams across E+D.\n\n \n\nWe build Customer Lifecycle and Multi-Tenant Management experiences in Microsoft 365 Admin Center and Microsoft 365 Lighthouse for SMB Customers and their Partners, aka Managed Service Providers (MSPs)\n\n \n\nWe integrate and aggregate business and operational data pertaining to Users and their Devices from a multitude of Modern Work services, leverage ML and AI to generate Actionable Insights and Recommendations. We enable Standardization and Automation so Partners can scale to managing hundreds of Microsoft 365 tenants through a single pane of glass.\n\n \n\nWe are seeking a Senior Software Engineer, if you are passionate about delivering cloud-based solutions for a diverse set of customers in a fast-growing (SMB) business segment, and looking for career growth opportunities, we would love to speak with you!\n\n \n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n\nQualifications\nRequired Qualifications: \n\nBachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\nPrior experience developing scalable and performant cloud services.\nUI development experience and knowledge of UI frameworks - React, Angular or equivalent.\nOther Requirements:\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings:\n\nMicrosoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\nPreferred Qualifications: \n\nBachelor's Degree in Computer Science\nOR related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\nExperience with Microsoft .NET, React or equivalent.\nData stores like Cosmos DB, Azure Data Explorer (Kusto) or equivalent.\nDemonstrated experience in agile development environment.\nExperience with ML and AI model lifecycle (e.g., Data Preparation, Training, Experimentation).\nPrior experience working in tests automation frameworks.\n\nSoftware Engineering IC4 - The typical base pay range for this role across the U.S. is USD $117,200 - $229,200 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $153,600 - $250,200 per year.\n\n \n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay\n\n \n\nMicrosoft will accept applications for the role until Aug 7, 2024.\n\n \n\n\n \n\n#CSE\n\nResponsibilities\nDrive clarity of user requirements through direct engagement with customers and/or in collaboration with product and program managers.\nDevelop high quality code, automate tests, debug and troubleshoot live-site incidents with minimal technical oversight. \nIdentify gaps and improve engineering processes. \nEvangelize best practices for engineering excellence.\nProvide mentorship to early career engineers, contribute to systems architecture, design and code reviews.\nEmbody our Culture and Values  ",
    "notes": "",
    "minSalary": 117200,
    "maxSalary": 229299,
    "postingUrl": "https://jobs.careers.microsoft.com/global/en/job/1737795/Senior-Software-Engineer",
    "hiringTeam": null,
    "techStack": []
  },
  {
    "id": 90,
    "jobTitle": "Software Engineer",
    "companyName": "Microsoft",
    "status": 2,
    "dateApplied": "2024-07-17T00:00:00",
    "jobDescription": "Overview\nMicrosoft is a company where innovators come to collaborate, envision what can be and take their careers to levels they cannot achieve anywhere else. This is a world of more possibilities, more innovation, more openness, and the sky is the limit thinking in a cloud-enabled world. \n\n \n\nMicrosoft’s Azure Data engineering team is leading the transformation of analytics in the world of data with products like Power BI, Synapse Analytics, Azure Data Factory, Azure Data Explorer.  We will bring the world’s data to the Microsoft Cloud, power a new class of data first applications, and empower everyone on the planet to make better decisions with data. \n\n  \n\nJoin our team of research and data engineers in advancing AI in healthcare. We're looking for an engineer who thrives in a fast-paced environment and is motivated by creating real-world benefits. You will test and benchmark leading AI models for their application in Health and Life Sciences.\n\n \n\nWe are looking for a Software Engineer to join our team!\n\n \n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n\nRelocation assistance is not available for this role.\n\n \n\nQualifications\nRequired/Minimum Qualifications:\n\nBachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript or Python.\n2+ years of experience as a full-stack developer, developing front-end as well as backend code utilizing node.js/react or similar.\n2+ years of experience with Azure and AzureML or similar products.\nOther Requirements:\n\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check:\n\nThis position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\nPreferred Qualifications:\n\n \n\nSRE experience to configure/deploy/maintain end-points / experience deploying setting-up models\nInterest in AI/machine learning in healthcare.\nSoftware Engineering IC3 - The typical base pay range for this role across the U.S. is USD $98,300 - $193,200 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $127,200 - $208,800 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay\n\n Microsoft will accept applications for the role until July 20, 2024. \n\n \n\n\nResponsibilities\nWe are looking for a full-stack Software Engineer with experience working with all service aspects of high throughput Artificial Intelligence-Language Model (AI-LM) pipelines, including working with internal component providers and their APIs, ability to design components carefully, and properly handle errors.\n\n \n\nDevelop, test and maintain the codebase/repo for all Health and Life Sciences (HLS) benchmarks and experiment pipelines in tandem with Babelbench (Microsoft’s internal platform for model evaluation and benchmarking).\nActive use and participation with main Babelbench code and team.\nCreate new GUI elements and experiences as needed to appropriately render HLS-relates benchmarks and use-cases within Babelbench (and other reporting tools as required).\nStand-up new models / end-points and maintain existing end-points to provide a reliable and comparable set of benchmarks.\nWork with product, customer-facing and research teams to develop new datasets and benchmarks as required to fulfill identified, real-life use-cases.\nPublish all benchmark results in appropriate forums (Babelbench and others as required) in compliance with Microsoft’s privacy, security and customer commitments.\nEmbody our Culture and Values",
    "notes": "",
    "minSalary": 98300,
    "maxSalary": 193200,
    "postingUrl": "https://jobs.careers.microsoft.com/global/en/job/1721789/Software-Engineer",
    "hiringTeam": null,
    "techStack": []
  },
  {
    "id": 91,
    "jobTitle": "Senior Software Engineer",
    "companyName": "Microsoft",
    "status": 0,
    "dateApplied": "2024-07-17T00:00:00",
    "jobDescription": "Overview\nIt is a mobile first, cloud first world and we’re empowering it.  Microsoft Azure is at the heart of the Microsoft Cloud providing the backend infrastructure for hyper-scale distributed and dynamic computing.  Our team within Azure provides the software platform which enables internal Microsoft services (including Office 365, Bing.com, XBOX Live, Skype, and OneDrive) as well as many external customers to run their large-scale mission-critical Cloud applications for their businesses.\n\n\nWe are looking for a world-class Senior Software Engineer to help us continue to evolve, expand, and define our software platform and infrastructure.  Some of the many areas we are tackling include ring 0 and (-1) core infrastructure services, five 9s (99.999%) reliability, fault-tolerance, distributed service monitoring, operational efficiency within the datacenter hardware lifecycle, performance metrics collection/analysis, alerting, visualization, device operations, and coordination of node diagnostics and repairs.\n\nThis is a fun and fast-paced environment and a great opportunity to work on something highly strategic to Microsoft and extremely relevant in the industry.  There are very few opportunities in Computer Science which have the potential impact to work at the massive scale like we do.  If you’re like us and passionate about building robust highly distributed software systems defining the backbone to the Microsoft Cloud, let’s talk.\n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n\nQualifications\nRequired Qualifications:\n\nBachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\nOther Qualifications:\n\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: \nMicrosoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.\nPreferred Qualifications:\n\nBachelor's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\nExperience with Distributed System design and implementation.\nCommitment to improving system quality, performance and reliability and engineering excellence.\nSoftware Engineering IC4 - The typical base pay range for this role across the U.S. is USD $117,200 - $229,200 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $153,600 - $250,200 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay.\n\n\nMicrosoft will accept applications for the role until August 7, 2024. \n\n \n\n\n \n\n#azurecorejobs\n\nResponsibilities\nDesign and develop solutions that builds and improve cloud services running over distributed system.\nProvide new features for Microsoft Cloud internal infrastructure software.\nKeep infrastructure services running and deliver code updates on a regular cadence to improve performance and reliability.\nCollaborates with appropriate stakeholders to determine user requirements for scenarios.\nActs as a Designated Responsible Individual (DRI) and guides other engineers by developing and following the playbook, working on call to monitor system/product/service for degradation, downtime, or interruptions, alerting stakeholders about status and initiates actions to restore system/product/service for simple and complex problems when appropriate.\nEmbody our Culture  &  Values ",
    "notes": "",
    "minSalary": 117200,
    "maxSalary": 229200,
    "postingUrl": "https://jobs.careers.microsoft.com/global/en/job/1737654/Senior-Software-Engineer",
    "hiringTeam": null,
    "techStack": []
  },
  {
    "id": 92,
    "jobTitle": "Software Engineer II",
    "companyName": "Microsoft",
    "status": 0,
    "dateApplied": "2024-07-17T00:00:00",
    "jobDescription": "https://jobs.careers.microsoft.com/global/en/job/1734843/Software-Engineer-II\nOverview\nOur Buses and Windows Driver Framework team is at the heart of the operating system, working closely with hardware ecosystems to light up new connectivity technologies. These technologies raise the security bar, improve system performance and are the underpinnings of many user experiences in the operating system. As a Software Engineer II on our Buses and Windows Driver Framework team, you’ll play a role in building connectivity technologies. Join us in shaping the future!\n\n \n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n\n \n\nIn alignment with our Microsoft values, we are committed to cultivating an inclusive work environment for all employees to positively impact our culture every day.\n\nQualifications\nRequired Qualifications:\n\nBachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\n \n\nOther Requirements\n\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check:\nThis position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\n \n\n \n\nPreferred Qualifications:\n\nExperience with systems programming or operating system internals.\nDriver development with C/C++.\nDesigning and debugging in the operating system.\nGood collaboration and communication skills.    \n \n\n \n\nSoftware Engineering IC3 - The typical base pay range for this role across the U.S. is USD $98,300 - $193,200 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $127,200 - $208,800 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay\n\nMicrosoft will accept applications for the role until August 7, 2024.\n\n \n\n \n\n\n \n\n#CoreOSJobs\n#AEPJobs\n\nResponsibilities\nBuilding and contributing to connectivity technologies. Diverse Learning Opportunities: Dive into a wide range of technologies. Some of what we build includes - Windows Driver Frameworks (WDF); Input stack (HID), Touch/Input drivers, USB bus, USB Type-C and low power buses like I3C, I2C, SPI etc.\nContributes to the identification of dependencies, and the development of design documents. Writes code that is extensible and maintainable considering diagnosability, reliability and security.\nHelps to identify areas of dependencies with other teams and drives coordination.\nFriendly and Collaborative Environment: Join a team of developers who value diversity and bring unique experiences to the table.\nImpact: Your work will directly influence the performance, security and functionality of devices used by billions.\nEmbody our culture and values.",
    "notes": "",
    "minSalary": 98300,
    "maxSalary": 193200,
    "postingUrl": null,
    "hiringTeam": null,
    "techStack": []
  },
  {
    "id": 93,
    "jobTitle": "Platform Engineering Manager",
    "companyName": "CHG Healthcare",
    "status": 0,
    "dateApplied": "2024-07-18T00:00:00",
    "jobDescription": "https://chghealthcare.wd1.myworkdayjobs.com/en-US/External/job/Platform-Engineering-Manager_JR102324\nHealthcare’s helping hand.\n\nCHG shook things up in 1979 by inventing the locum tenens staffing model. We connect doctors with patients who need their care. As the largest physician staffing firm in America, our providers treat millions of patients each year.\n\nOur industry is growing and demand is high. This means you’ll have plenty of opportunities to grow and develop in your career. Keeping healthcare healthy can be as fun as it is rewarding\n\nWe are seeking a talented Engineering Infrastructure Platform Manager who is passionate about enhancing the developer experience and fostering collaboration within our development squads.\n\nIn this role, you will be instrumental in optimizing our cloud native infrastructure platform to meet the unique needs of our development teams. You will work closely with our product manager and cross-functional squads to understand their requirements, provide leadership guidance, and ensure tactical execution.\n\nResponsibilities:\n\nLead a team of engineers to optimize our engineering infrastructure platform for developer experience and team collaboration.\nPartner with our Product Manager and collaborate with engineering leaders and teams to understand their workflows, challenges, and wants.\nImplement solutions that enhance the Developer Experience through common deployment processes and strategic foresight.\nWork closely with platform engineers to design and deploy scalable, reliable infrastructure solutions.\nChampion best practices and efficiency for infrastructure management, automation, and monitoring through continuous integration and development processes.\nInvolved in strategic plans to accomplish technical, as well as business goals.\nLead by example and core values behavior in striving for a positive impact to customers (our developers) and the business in all deliverables.\nEnsure team is current on technical knowledge and tools through active development planning and coaching.\nDevelop, track, and report key implementation metrics to drive a qualitative experience.\nQualifications:\n\nExcellent communication and collaboration skills, with a proven ability to work effectively across teams.\nA bachelor’s degree in computer science or equivalent experience and 2-5 years of experience in platform engineering.\nKnowledge in Infrastructure as Code (IaC) tools such as Terraform as well as container orchestration platforms like Kubernetes.\nDeep understanding of cloud computing principles and platforms (e.g., AWS, Azure, Google Cloud).\nStrong problem-solving skills and a passion for driving continuous improvement within a micro service architecture.\nExperience working in Agile or similar development methodologies.\nWe believe in fair compensation for all of our people, which is why our pay structure takes into account the cost of labor across U.S. geographic markets. For this position, we offer a pay range of 114,300 -- $276,900 annually, with pay varying depending on work location and job-related factors such as knowledge, position level and experience. During the hiring process, your recruiter can provide more information about the specific salary range for the job location. \n\nCHG Healthcare offers starting salaries for sales positions in the form of total target compensation (TTC = base + commission + bonus), which includes base pay, commission, and bonuses. Sales positions receive short-term incentives through commission plans and bonuses. On the other hand, non-sales positions have starting salaries that consist of a base salary and short-term incentives through various bonus plans, which are paid out monthly, quarterly, or annually. \n\nIn return we offer:\n\n• 401(k) retirement plan with company match\n\n• Traditional healthcare benefits such as medical and dental coverage, and some unique benefits like onsite health centers, corporate wellness programs, and free behavioral health appointments.\n• Flexible work schedules - including work-from-home options available\n• Recognition programs with rewards including trips, cash, and paid time off\n• Family-friendly benefits including paid parental leave, fertility coverage, adoption assistance, and marriage counseling\n• Tailored training resources including free LinkedIn learning courses\n• Volunteer time off and employee-driven matching grants\n• Tuition reimbursement programs",
    "notes": "",
    "minSalary": 114300,
    "maxSalary": 276900,
    "postingUrl": null,
    "hiringTeam": null,
    "techStack": []
  },
  {
    "id": 97,
    "jobTitle": "Backend Engineer: Search Features & APIs",
    "companyName": "Constructor",
    "status": 0,
    "dateApplied": "2024-07-19T00:00:00",
    "jobDescription": "Description\nYou're an engineer who loves solving problems, learning, and making people's lives easier. You enjoy thinking about the product as a whole and developing features that work seamlessly and reliably. You get satisfaction from building a scalable product that people love to use. You enjoy jumping between different layers of the stack and you’re equipped with a wide range of tools and technologies. You take pride in your reliable code and embrace automated testing as unequivocally good. You are motivated to balance cutting edge technology with stability and robustness to build something truly useful. You want to build things you can be proud of, and work with an international team of experienced, passionate engineers.\n\nAs a Backend Engineer in the Search team, you'll work closely with product to plan and deliver features that impact the whole stack, all the way from the search backend, to our APIs, to the customer dashboard. You will be building rich product discovery experiences and developing features that define how users interact with search. You'll help determine what technologies we use to make backend performance and database communication blazing fast, and you'll help craft testing strategies to make sure uptime is 100% and customers stay satisfied.\n\nAbout Us\nConstructor is the only search and product discovery platform tailor-made for enterprise ecommerce where conversions matter. Constructor's AI-first solutions make it easier for shoppers to discover products they want to buy and for ecommerce teams to deliver highly personalized experiences that drive impressive results. Optimizing specifically for ecommerce metrics like revenue, conversion rate and profit, Constructor generates consistent $10M+ lifts for some of the biggest brands in ecommerce, such as Sephora, Petco, home24, Maxeda Brands, Birkenstock and The Very Group. Constructor is a U.S. based company that was founded in 2015 by Eli Finkelshteyn and Dan McCormick. For more, visit: .\n\nRequirements\nYou will be successful in this role if you've done some or all of the below:\n\nHave experience with server-side coding and API design\nHave worked at a high-traffic website and designed highly available and robust systems\nHave experience with relational databases and distributed systems\nEnjoy being part of the product development process and incorporating customer feedback into your solutions.\nLove defining and implementing beautiful and inherently consistent Web APIs\nEnjoy working across the full stack, contributing to all layers of feature development\nLove designing and implementing new features\nEnjoy helping others around you grow as developers and be successful\nCan work independently\nPick up new ideas and technologies quickly, love learning and talking to others about them\nLove to experiment and use data and customer feedback to drive decision making\nBenefits\nUnlimited vacation time — we strongly encourage all of our employees take at least 3 weeks per year\nFully remote team — choose where you live\nApple laptop provided for new employees\nTraining and development budget for every employee, refreshed each year\nParental leave for qualified employees\nWork with smart people who will help you grow and make a meaningful impact\n​​Compensation: base range of 80-110K USD + stock options\nWork from home stipend! We want you to have the resources you need to set up your home office\nCompany Retreat to Canary Island (if joined the team before AUG 1)\nDiversity, Equity, and Inclusion at Constructor\n\nAt Constructor.io we are committed to cultivating a work environment that is diverse, equitable, and inclusive. As an equal opportunity employer, we welcome individuals of all backgrounds and provide equal opportunities to all applicants regardless of their education, diversity of opinion, race, color, religion, gender, gender expression, sexual orientation, national origin, genetics, disability, age, veteran status or affiliation in any other protected group. Studies have shown that women and people of color may be less likely to apply for jobs unless they meet every one of the qualifications listed. Our primary interest is in finding the best candidate for the job. We encourage you to apply even if you don’t meet all of our listed qualifications.\n",
    "notes": "",
    "minSalary": 80000,
    "maxSalary": 110000,
    "postingUrl": "https://apply.workable.com/constructor-1/j/7911D2324F/",
    "hiringTeam": "Search team",
    "techStack": []
  },
  {
    "id": 100,
    "jobTitle": "Senior Software Engineer",
    "companyName": "Microsoft",
    "status": 0,
    "dateApplied": "2024-07-19T00:00:00",
    "jobDescription": "Overview\n \n\nCommerce + Ecosystems (C+E) is responsible for enabling and optimizing the end-to-end customer journey on the Microsoft Cloud. C+E’s Commerce Platform and Experience (CPX) team helps customers learn about, purchase and pay for Microsoft and third-party products and services by facilitating all transactions, as well as managing the core commerce engine that powers Microsoft business, sales motions, and cloud strategy.\n\n \n\nThe goal of CPX core commerce services team is to foster a data-driven culture, to encourage and enable the azure customers and partners to make more informed decisions through data. As part of that work, the team develops and operationalizes the large scale distributed data platform that enables Microsoft customers to realize and manage cloud costs and partner teams to operationalize their goals.     \n\n \n\nWe are hiring for a Senior Software Engineer who can deliver and manage data solutions. \n\n \n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond. \n\n \n\nQualifications\nRequired Qualifications:\n\nBachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\n4+ years of experience in back-end development\nOther Requirements:\n\n \n\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role.  Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter. \n\n \n\nPreferred Qualifications:\n\nBachelor's Degree in Computer Science\nOR related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript,\nOR Python\nOR Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\nSoftware Engineering IC4 - The typical base pay range for this role across the U.S. is USD $117,200 - $229,200 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $153,600 - $250,200 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay\n\nMicrosoft will accept applications for the role until July 30, 2024.\n\n\n \n\n\n \n\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter. \n\n \n\n#C+E  \n\nResponsibilities\n \n\n \n\nDesign and implement user-centric features for the Microsoft Cloud platform, using customer feedback, usage data, and industry best practices to deliver engaging and intuitive solutions. \nMeasure and evaluate the impact and outcomes of the delivered features, using quantitative and qualitative metrics, and identify areas for improvement and enhancement. \nContribute to product architecture, test plans, and dependency management with oversight, ensuring adherence to security and compliance standards while driving coordination among teams. \nAutomate production and deployment processes, ensure compliance with security standards, stay updated with industry developments for product improvement, implement best coding practices, and maintains communication with key partners to align product development with customer needs. \nCreate and implement high-quality, maintainable code for products or features, diagnosability and reliability, proactively verifies assumptions, conducts retrospective debugging, review code to ensure it meets quality standards, and apply coding patterns and best practices in code reviews. \nMaintain live service operations, identify and mitigate issues, integrating telemetry for system behavior analysis, and contributing to data analysis for refining product features. \nEmbody our Culture and Values",
    "notes": "",
    "minSalary": 117200,
    "maxSalary": 229200,
    "postingUrl": "https://jobs.careers.microsoft.com/global/en/job/1727677/Senior-Software-Engineer",
    "hiringTeam": "C+E’s Commerce Platform and Experience (CPX)",
    "techStack": []
  },
  {
    "id": 101,
    "jobTitle": "Senior Software Engineer",
    "companyName": "Microsoft",
    "status": 0,
    "dateApplied": "2024-07-19T00:00:00",
    "jobDescription": "Overview\nTeams is the fabric of how we communicate and collaborate, bringing together your chats, meetings, apps, files and much more. Whether you use it for work, school, or life, over 300M people rely on Teams every day to stay productive and connected with colleagues, partners customers, friends, and family. Our users expect Teams to have great fundamentals – to be fast, resource efficient and reliable, and the new Teams app is re-architected and optimized from the ground up to deliver on that promise. Our journey is just getting started with the new era of Teams.\n\n \n\nWe are looking for an experienced Senior Software Engineer to join the Teams fundamentals organization and help drive multiple initiatives to make Teams best in class at reliability and resiliency. This includes innovating on how we intelligently use telemetry to measure reliability for our different audiences, how we use customer feedback, how we create diagnostics and analytics at scale to enable faster detection and debugging, how we collaborate with other teams to achieve end-end engineering excellence, and how we build resilient architectures.\n\n \n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n\nQualifications\nRequired Qualifications:\n\nBachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\nExperience leading cross-functional efforts to understand and implement user requirements.\nOther Requirements:\n\n\nThis position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\n\n \n\nPreferred Qualifications:\n\n8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript,or Python\nSolid problem-solving skills and the ability to analyze and debug complex systems and design solutions.\nExperience with Microsoft Teams or similar collaboration platforms is highly desirable.\nExcellent communication skills and ability to effectively articulate technical concepts to both technical and non-technical stakeholders.\nSoftware Engineering IC4 - The typical base pay range for this role across the U.S. is USD $117,200 - $229,200 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $153,600 - $250,200 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay\n\nMicrosoft will accept applications for the role until July 23, 2024.\n\n \n\n\nResponsibilities\nCollaborate with cross-functional teams to understand user requirements for enhancing the reliability and resiliency of Microsoft Teams.\nLead the identification of dependencies and contribute to the development of design documents aimed at improving the reliability and performance of Teams.\nDevelop, optimize, and debug code to enhance the reliability, efficiency, and maintainability of Teams, ensuring a high return on investment.\nUtilize experience in product features to partner with project managers and drive project plans, release plans, and work items related to reliability initiatives.\nStay updated on industry trends, emerging technologies, and best practices in reliability engineering to continuously improve the availability, efficiency, and performance of Microsoft Teams, while ensuring consistency in monitoring and operations at scale.\nEmbody our Culture and Values ",
    "notes": "",
    "minSalary": 117200,
    "maxSalary": 229200,
    "postingUrl": "https://jobs.careers.microsoft.com/global/en/job/1719310/Senior-Software-Engineer",
    "hiringTeam": "Teams fundamentals organization",
    "techStack": []
  },
  {
    "id": 102,
    "jobTitle": "Software Engineer",
    "companyName": "Microsoft",
    "status": 0,
    "dateApplied": "2024-07-19T00:00:00",
    "jobDescription": "Overview\nMicrosoft is a company where passionate innovators come to collaborate, envision what can be and take their careers further. This is a world of more possibilities, more innovation, more openness, and the sky is the limit thinking in a cloud-enabled world.\n\nMicrosoft’s Azure Data engineering team is leading the transformation of analytics in the world of data with products like databases, data integration, big data analytics, messaging & real-time analytics, and business intelligence. The products our portfolio include Microsoft Fabric, Azure SQL DB, Azure Cosmos DB, Azure PostgreSQL, Azure Data Factory, Azure Synapse Analytics, Azure Service Bus, Azure Event Grid, and Power BI. Our mission is to build the data platform for the age of AI, powering a new class of data-first applications and driving a data culture.\n\n \n\nWithin Azure Data, the databases team builds and maintains Microsoft's operational Database systems. We store and manage data in a structured way to enable multitude of applications across various industries. We are on a journey to enable developer friendly, mission-critical, AI enabled operational Databases across relational, non-relational and OSS offerings.\n\n \n\nMicrosoft has transformed itself into the undisputed leader driving innovations in data platform capabilities. Our data platform powers innovation in every industry, facilitates breakthrough scientific and medical research, and underpins intelligent applications that are changing the way people live. Enterprises and research institutions are using this platform to disrupt markets and transform their businesses. From Edge to Cloud and spanning multiple operating systems, and multiple public and private clouds the Azure Data Platform provides limitless career growth opportunities.\n\nAzure Cosmos DB is Microsoft’s next generation globally distributed, massively scalable, multi-model cloud database service. It is designed to enable developers to build planet-scale applications. Azure Cosmos DB is one of the fastest growing Azure services. Joining the Azure Cosmos DB team is a fantastic opportunity to work with incredibly talented engineers operating like a startup and be at the forefront of building distributed services at scale.\n\nWe are looking for a Software Engineer  to join our team and to take data driven decisions and build innovative solutions to support the business growth. You will be responsible for designing and building reliable, high-performance, low-latency solutions for Cosmos DB services at scale. You will work across the stack and collaborate with engineers on the team to convert vision into a high quality, shipped product.\n\n\nOur team focuses on diversity of all types of candidates for our roles and we strive to hire people with different experiences and perspectives into our team. To that end, we know that no candidate has every desired skill and experience, but all of us together make our team effective. We do not just value differences or different perspectives. We seek them out and invite them in so we can tap into the collective power of everyone in the company. As a result, our customers are better served.\n\n\nWe do not just value differences or different perspectives. We seek them out and invite them in so we can tap into the collective power of everyone in the company. As a result, our customers are better served.\n\n \n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond. \n\nIn alignment with our Microsoft values, w\n\nQualifications\nRequired/Minimum Qualifications\n\nBachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\nOther Requirements\n\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check:\n\nThis position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\n\n \n\nPreferred/Additional Qualifications\n\nBachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR Master's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\nUnderstanding of distributed systems and/or Operating System internals is highly preferred.\nExperience with multi-threaded/parallel programming and performance tuning.\nSoftware Engineering IC3 - The typical base pay range for this role across the U.S. is USD $98,300 - $193,200 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $127,200 - $208,800 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay\n\nMicrosoft will accept applications for the role until July 25, 2024.\n\n\n\n \n\n#azdat\n\n#azuredata\n\n#cosmosdb #databases #ENGGJOBS\n\nResponsibilities\nContribute to the architecture and implementing components of the Cosmos DB service for running the product on different hardware architectures and platforms. Contribute to proposals for architecture by testing design hypotheses and helping to refine code plans.\nApply debugging and profiling tools, logs, telemetry, and other methods to verify assumptions proactively before issues occur and reactively as issues occur for product features. Conduct retrospective debugging of solutions to identify root causes of problems.\nConduct and create experimentation to determine the effectiveness of changes for prototyping and testing features and apply findings back into development.\nMentor less experienced engineers to help them reach their utmost potential.\nOther \n\nEmbody our Culture and Values ",
    "notes": "",
    "minSalary": 98300,
    "maxSalary": 193200,
    "postingUrl": "https://jobs.careers.microsoft.com/global/en/job/1741974/Software-Engineer",
    "hiringTeam": "Microsoft’s Azure Data engineering team",
    "techStack": []
  },
  {
    "id": 103,
    "jobTitle": "Senior Software Engineer",
    "companyName": "Microsoft",
    "status": 0,
    "dateApplied": "2024-07-19T00:00:00",
    "jobDescription": "Overview\nAre you looking for an opportunity to build software and systems for some of the biggest data centers that humanity has ever created? The Azure Networking team is responsible for designing and building the software defined network infrastructure that powers millions of servers around the globe for Azure, Bing, Microsoft cloud services and AI Network. Azure Networking is at the forefront of Hyperscale Cloud Computing and runs one of the largest datacenter network infrastructures in the world. The Azure Networking team works on the breadth of networking offerings. The physical network team manages all physical switches and routers inside Azure datacenters.\n\n\nNetwork and Device Health team strives to ensure that Azure has the world's most reliable and high-performance network. As a Senior Software Engineer, you will be responsible for designing, building, deploying, and maintaining large-scale distributed software systems that verify network states, detect issues that degrade network reliability and quality, alert and localize such issues quickly. This opportunity will provide you with hands-on experience in network monitoring, help you gain a deep understanding of the Azure networking stack, and make you proficient at the software development lifecycle.\n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n\n \n\nIn alignment with our Microsoft values, we are committed to cultivating an inclusive work environment for all employees to positively impact our culture every day.\n\nQualifications\nRequired Qualifications:\n\nBachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience\nOther Requirements:\n\n \n\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: \nMicrosoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.\n \n\nPreferred Qualifications:\n\nBachelor's Degree in Computer Science\nOR related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript,\nOR Python\nOR Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience\n4+ years of experience in networking or cloud infrastructure\nSoftware Engineering IC4 - The typical base pay range for this role across the U.S. is USD $112,000 - $218,400 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $145,800 - $238,600 per year.\n\n \n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay   \n\n \n\nMicrosoft will accept applications for the role until Aug 31, 2024.\n\n \n\n\n \n\n#azurecorejobs\n\nResponsibilities\nCollaborates with appropriate stakeholders to determine user requirements for a scenario.\nDrives identification of dependencies and the development of design documents for a product, application, service, or platform.\nCreates, implements, optimizes, debugs, refactors, and reuses code to establish and improve performance and maintainability, effectiveness, and return on investment (ROI).\nLeverages subject-matter expertise of product features and partners with appropriate stakeholders (e.g., project managers) to drive a workgroup's project plans, release plans, and work items.\nActs as a Designated Responsible Individual (DRI) and guides other engineers by developing and following the playbook, working on call to monitor system/product/service for degradation, downtime, or interruptions, alerting stakeholders about status and initiates actions to restore system/product/service for simple and complex problems when appropriate.\nWork with network engineers to support Azure production network.\nProactively seeks new knowledge and adapts to new trends, technical solutions, and patterns that will improve the availability, reliability, efficiency, observability, and performance of products while also driving consistency in monitoring and operations at scale.\n \n\nOther\n\nEmbody our Culture and Values\n",
    "notes": "",
    "minSalary": 112000,
    "maxSalary": 218400,
    "postingUrl": "https://jobs.careers.microsoft.com/global/en/job/1714035/Senior-Software-Engineer",
    "hiringTeam": "Network and Device Health team",
    "techStack": []
  },
  {
    "id": 104,
    "jobTitle": "Senior Software Engineer",
    "companyName": "Microsoft",
    "status": 0,
    "dateApplied": "2024-07-19T00:00:00",
    "jobDescription": "Overview\nThe Microsoft Applied Sciences Group (ASG), a nimble startup group within Microsoft’s Windows division, seeks a Senior Software Engineer to help push the envelope of user experiences at the intersection of software, machine learning, and hardware.\n\n \n\nIn the past, we’ve typically explored new user experience concepts and built the earliest prototypes, then collaborated with other, bigger teams to bring a product to market. We’re now looking to continue that work, with a view to the new interactions enabled by recent advances in Large Language Models (LLM) and other large AI/ML models.\n\n \n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n\n \n\nIn alignment with our Microsoft values, we are committed to cultivating an inclusive work environment for all employees to positively impact our culture every day.\n\nQualifications\nRequired/Minimum Qualifications\n\nBachelor's Degree in Computer Science, or related technical discipline AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\n2+ years' experience writing efficient and production grade C++ or C# code.\n1+ year experience with full stack Web development using TypeScript or JavaScript.\n \n\nAdditional or Preferred Qualifications\n\n4+ years of industry experiences with one or more of the following: Windows or mobile app development, full stack Web development, with coding experience in C++, C#, Swift, TypeScript or JavaScript\nEnd to end project development experience including the research and incubation phases of a commercial project\nFamiliarity with mobile app development in iOS or Android\nPrevious experience with User Interface (UI) development on different frontend frameworks such as React or FAST JS\nCompetent design skills and tooling knowledge\nAbility to span across a large number of areas while getting sufficiently deep in new focus areas where necessary\nSoftware Engineering IC4 - The typical base pay range for this role across the U.S. is USD $112,000 - $218,400 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $145,800 - $238,600 per year.\n\n \n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay   \n\n \n\nMicrosoft will accept applications and processes offers for these roles on an ongoing basis.\n\n \n\n\nResponsibilities\nYou will be joining a team of highly collaborative engineers and will be at the forefront of technology, tackling interesting and complicated challenges.\nOur focus changes often, so you should be comfortable working on many different projects and different areas of the tech stack.\nIn this role you would be:\nWriting high quality C++/C#/Swift code for various desktop, cloud and embedded platforms\nUnderstand web technologies and developing single page applications using JavaScript and TypeScript\nDesign and defend high quality user experiences that delight our customers\nBe comfortable with a fast-paced environment and a high level of ambiguity\nOther\nTravel\nOur remote team is spread across Canada and the US. You may be occasionally asked to travel to Toronto or Redmond when the team meets in person.\nEmbody our Culture and Values",
    "notes": "",
    "minSalary": 11200,
    "maxSalary": 218400,
    "postingUrl": "https://jobs.careers.microsoft.com/global/en/job/1696314/Senior-Software-Engineer",
    "hiringTeam": "Microsoft Applied Sciences Group (ASG)",
    "techStack": []
  },
  {
    "id": 105,
    "jobTitle": "Senior Software Engineer",
    "companyName": "Microsoft",
    "status": 0,
    "dateApplied": "2024-07-19T00:00:00",
    "jobDescription": "Overview\nMicrosoft is a company where passionate innovators come to collaborate, envision what can be and take their careers further. This is a world of more possibilities, more innovation, more openness, and the sky is the limit thinking in a cloud-enabled world. \n \nMicrosoft’s Azure Data engineering team is leading the transformation of analytics in the world of data with products like databases, data integration, big data analytics, messaging & real-time analytics, and business intelligence. The products our portfolio include Microsoft Fabric, Azure SQL DB, Azure Cosmos DB, Azure PostgreSQL, Azure MySQL, Azure Data Factory, Azure Synapse Analytics, Azure Service Bus, Azure Event Grid, and Power BI. Our mission is to build the data platform for the age of AI, powering a new class of data-first applications and driving a data culture. \n\n \n\nWithin Azure Data, the databases team builds and maintains Microsoft's operational Database systems. We store and manage data in a structured way to enable multitude of applications across various industries. We are on a journey to enable developer friendly, mission-critical, AI enabled operational Databases across relational, non-relational and OSS offerings. \n\n \n\nAzure Database for MySQL is a fully managed relational database service from Microsoft. Our team is part of Database Systems organization and building the MySQL service on the common platform supporting all relational database workloads and leveraging the scale of our global presence in all Azure datacenters. We are looking for a Senior Software Engineer about tackling the breadth of issues coming from running online services, such as improving availability, scalability, query performance and processing, storage and networking optimizations, operating systems integration, and more. If you would like to help us make Azure the best place to run MySQL database workloads, please let us know. \n \nThe group fosters a diverse and inclusive work culture that prioritizes people at all times. We spend our days collaborating with, teaching, and learning from a diverse set of world class engineers. We develop, test, and check code in every day. We do not just value differences or different perspectives, we seek them out and invite them in so we can tap into the collective power of everyone in the company. As a result, our customers are better served. \n \nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond. \n \nIn alignment with our Microsoft values, we are committed to cultivating an inclusive work environment for all employees to positively impact our culture every day. \n \n\nWe do not just value differences or different perspectives. We seek them out and invite them in so we can tap into the collective power of everyone in the company. As a result, our customers are better served.\n\nQualifications\nRequired/Minimum Qualifications \n\nBachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python \nOR equivalent experience. \nOther Requirements \n\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: \n\nThis position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter. \nPreferred/Additional Qualifications \n\nBachelor's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python \nOR Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python \nOR equivalent experience. \n4+ years of experience building and shipping production grade software or services.\n3+ years experience with at least one relational database systems, such as MySQL.  \n \n\nSoftware Engineering IC4 - The typical base pay range for this role across the U.S. is USD $117,200 - $229,200 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $153,600 - $250,200 per year.   \n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay   \n\n \n\nMicrosoft will accept applications for the role until June 18, 2024.\n\n \n\n\n \n\n#azdat #azuredata #ENGJOBS #DTPJOBS #mysql  \n\nResponsibilities\nWork on a team of world-class engineers, constantly learning, teaching, and collaborating to achieve excellence. \nDevelop, test, and check-in code to deliver the best possible product to our customers. \nMakes decisions driven by data and customer feedback, allowing us to solve issues and make improvements in a timely and efficient manner. \nInvests time in building robust engineering systems that reduce overhead and enable us to focus on new challenges. \nEmbraces open-source technologies and are always on the lookout for opportunities to use existing solutions. \nSolves problems by always leading with empathy for our customers.  \nLooks forward to the next problem, the next experiment, the next partner. Work collaboratively, solve problems with groups, find win/win solutions and celebrate successes. \nEmbody our culture and values ",
    "notes": "",
    "minSalary": 117200,
    "maxSalary": 229200,
    "postingUrl": "https://jobs.careers.microsoft.com/global/en/job/1721983/Senior-Software-Engineer",
    "hiringTeam": "Azure Data",
    "techStack": []
  },
  {
    "id": 106,
    "jobTitle": "Software Engineer II",
    "companyName": "Microsoft",
    "status": 0,
    "dateApplied": "2024-07-19T00:00:00",
    "jobDescription": "Overview\nMicrosoft is built on trust, and Azure is dedicated to becoming the most trusted cloud service for its customers. As Azure expands its services, certifications, and regions for its global customers, there is a growing need for increased support to uphold customer promises. The Azure Core Trusted Platform team is committed to enabling product teams to deliver capabilities that align with customer commitments and provide transparency.\n\n\nIf you're a skilled a Software Engineer II who is passionate about building cloud services and eager to learn new technologies, with the determination to solve complex technical problems, then this position is perfect for you. Join our diverse and welcoming team that is dedicated to building privacy, security, and compliance engineering solutions for the Azure cloud. We use cutting-edge Azure service, data, and ML technologies to create products that are widely used across Microsoft teams. Our team values inclusiveness and diverse ideas, and we prioritize empathy, trust, and ownership to drive our team culture and deliver products quickly and iteratively. You'll work in a fast-paced environment, tackling problems that require creativity and collaboration to achieve meaningful business outcomes. We continuously strive for world-class engineering and operational excellence and encourage you to influence our designs and architectural roadmap and drive specific goals around scalability and availability. Join us and help make Azure the most trusted cloud platform!\n\n \n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n\n \n\nRelocation assistance is unavailable for this role.\n\nQualifications\nRequired Qualifications: \n\nBachelor's Degree in Computer Science, or related technical discipline AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, or Java.\nOR equivalent experience.\nOther Requirements:\n\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings:\nMicrosoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\nAdditional / Preferred Qualifications:\n\nBachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, or Java.\nOR Master's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, or Java.\nOR equivalent experience.\nExperience in developing solutions for Cloud Security and services is plus.\n \n\nSoftware Engineering IC3 - The typical base pay range for this role across the U.S. is USD $94,300 - $182,600 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $120,900 - $198,600 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay\n\nMicrosoft will accept applications and processes offers for these roles on an ongoing basis.\n\n \n\n\n \n\n#Azurecorejobs\n\n#AzureCoreTrustedPlatform\n\n \n\nResponsibilities\nDesign and implement cloud engineering systems and platforms. \nWork with stakeholders across Azure to define the problem and to research design, and develop solutions .\nCollaborate with developers and program managers throughout the development lifecycle (sprint planning, scrums, code reviews and live site management, etc.).\nEmbody our culture and values",
    "notes": "",
    "minSalary": 94300,
    "maxSalary": 182600,
    "postingUrl": "https://jobs.careers.microsoft.com/global/en/job/1716532/Software-Engineer-II",
    "hiringTeam": "The Azure Core Trusted Platform team",
    "techStack": []
  },
  {
    "id": 107,
    "jobTitle": "Software Engineer",
    "companyName": "Microsoft",
    "status": 0,
    "dateApplied": "2024-07-19T00:00:00",
    "jobDescription": "Overview\nMicrosoft’s Cloud Operations and Innovation (CO+I) team builds and operates Microsoft datacenters, which in turn power Microsoft’s cloud business. We anticipate and provide capacity for continuous scale. The CO+I Engineering team (CO+IE) delivers services, applications, and automation supporting datacenter planning, construction, and operation. We own a large portfolio of services, including workflows that enable predicable, lowest cost datacenter construction, telemetry systems that drive high availability and optimized energy usage, and task and performance management applications that help our operation run as efficiently as possible. CO+I Engineering is an advantage for Microsoft, and an important pillar in its cloud success.\n\n \n\nWe are looking for a passionate, innovative individual contributor Software Engineer who can deal with ambiguity and challenge the status-quo to deliver automation capabilities that power the long-range execution planning efforts, drive workflow improvements and build solutions to assist in the delivery of large scale data centers through efficient management of cost and schedule.\n\n \n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n\nQualifications\nRequired/Minimum Qualifications:\n\nBachelor's Degree in Computer Science, or related technical discipline with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience.\nOther Requirements:\n\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to, the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\nPreferred/Additional Qualifications:\n\nBachelor's Degree in Computer Science OR related technical field AND 1+ year(s) technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, OR Python OR Master's Degree in Computer Science or related technical field with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience.\nSoftware Engineering IC2 - The typical base pay range for this role across the U.S. is USD $81,900 - $160,200 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $105,600 - $174,600 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay\n\nMicrosoft will accept applications for the role until August 2, 2024.\n\n\n\n#COICareers\n#COIEngCareers\n#COIE_DPXEcareers\n\nResponsibilities\n \n\nWork with appropriate stakeholders to determine user requirements for a feature.\nSupport identification of dependencies, and the development of design documents for a product feature with oversight.\nWith guidance, learn to create and implement code for a product, service, or feature reusing code as applicable.\nAssist and learn about breaking down work items into tasks and provides estimation.\nAct as a Designated Responsible Individual (DRI) in monitoring system/product feature/service for degradation, downtime, or interruptions for simple problems, and recommend actions to restore system/product/service by following the playbook.\nReview current developments and proactively seeks new knowledge that will improve the availability, reliability, efficiency, observability, and performance of products while also driving consistency in monitoring and operations at scale.\nOther\n\nEmbody our Culture  &  Values ",
    "notes": "",
    "minSalary": 81900,
    "maxSalary": 160200,
    "postingUrl": "https://jobs.careers.microsoft.com/global/en/job/1738705/Software-Engineer",
    "hiringTeam": "Cloud Operations and Innovation (CO+I) team",
    "techStack": []
  },
  {
    "id": 108,
    "jobTitle": "Software Engineer II",
    "companyName": "Microsoft",
    "status": 0,
    "dateApplied": "2024-07-19T00:00:00",
    "jobDescription": "Overview\nThe Commerce Platform and Experiences team is responsible for frictionless purchases and management of Microsoft and third-party products & services via portals and Application Program Interfaces. Our team is in a unique position to help improve customer experience and influence system design and partner services. We are hiring a Software Engineer II to  find the opportunity to make an impact and build to this scale.\n\n \n\n \n\nYou’ll build and manage secure, reliable, scalable, and maintainable stack, and then effectively debug, test and support in the production environment. You should be comfortable owning a feature and making decisions independently. You will be building end 2 end stack from experience to API layer. You will naturally share Microsoft’s culture and passion for growth mindset and set up for success and growth in your career. You will be mentoring others in the team and lead the features to successful delivery.\n\n \n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond. In alignment with our Microsoft values, we are committed to cultivating an inclusive work environment for all employees to positively impact our culture every day. \n\nQualifications\nRequired Qualifications:\n\nBachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\nOther Requirements: \n \nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings:\nMicrosoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\n \n\n \n\nPreferred Qualifications:\n\nBachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR Master's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience\n \n\nSoftware Engineering IC3 - The typical base pay range for this role across the U.S. is USD $98,300 - $193,200 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $127,200 - $208,800 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay\n\nMicrosoft will accept applications for the role until June 11, 2024.\n\n\n \n\n\n \n\n#C+E\n\nResponsibilities\n \n\nWorks with appropriate stakeholders (e.g., project manager, technical lead) to determine user requirements for a set of features.\nContributes to processes for the architecture of a product/solution feature and helps to create proposals for architecture by testing design hypotheses and helping to refine code plans, with technical leadership from others.\nCreates and implements code for a product, service, or feature, reusing code as applicable.\nReviews work items to deepen knowledge of product features in partnership with appropriate stakeholders (e.g., project managers) and executes project plans, release plans, and work items.\nMaintains operations of live service as issues arise on a rotational, on-call basis.\nContributes to efforts to collect, classify, and analyze data with little oversight on a range of metrics (e.g., health of the system, where bugs might be occurring). \nBuilds knowledge, shares new ideas, and shares pinpoints of engineering tool gaps to improve software developer tools to support other programs, tools, and applications to create, debug, and maintain code for complex product features.\nEmbody our Culture and Values",
    "notes": "",
    "minSalary": 98300,
    "maxSalary": 193200,
    "postingUrl": "https://jobs.careers.microsoft.com/global/en/job/1723441/Software-Engineer-II",
    "hiringTeam": "The Commerce Platform and Experiences team",
    "techStack": []
  },
  {
    "id": 109,
    "jobTitle": "Core Engineering",
    "companyName": "Automattic",
    "status": 0,
    "dateApplied": "2024-07-19T00:00:00",
    "jobDescription": "Core Engineering\nWe're looking for product-minded generalist engineers who can take on any project and solve any problem our users have.\n\nIs this you?\n\nYou are self-driven and self-motivated.\nUnderstanding the problem we're solving and how it helps the user is your first priority.\nSimple solutions are your favorite, even if they’re boring. For example, using PHP as the core of our backend makes sense to you.\nYou love debugging a stubborn issue. Friends and colleagues call you when they hit a wall.\nLearning is how you usually describe your growth as an engineer.\nWorking across the whole stack is how you operate, whether you're tasked with it or not. A new corner of the, even legacy, codebase is a fun challenge, not something to avoid.\nHere's what we can offer:\n\nNo formal engineering titles or levels.\nMost of our products operate at significant scale, both in terms of users and impact, and in terms of infrastructure.\nAutonomy, flexibility, and many opportunities to have an impact on the users, the business, and the organization.\nWe believe open-source is one of the most powerful ideas of our generation.\nMoving between teams and projects is a straight-forward, not bureaucratic or political process.\nIf that sounds exciting and you want to learn more, apply below.\n\nAt Automattic, we value diversity and know that different perspectives will ensure our team is innovative and creative thinking.",
    "notes": "Working remote and in an inclusive environment.\nSolving problems that align with the company's visions and goals.\nBeing challenged and given opportunities for growth.\nBeing part of a team and organization that values transparency and collaboration.\nHaving a manager/mentor that understand me, values me and guides me in the right direction.\n\nI have been a Software Engineer for seven years, all at UKG Inc. My career started as an Intern and my last role was of a Senior Software Engineer. My roles have been Backend Developer, Quality Engineer,  Full-Stack Developer, and Automation Developer, with my favorite area to work on being the backend. I have worked with C#, TypeScript/Angular, SQL, and some Python; currently I am learning React and working on my .NET development skills. In my most recent role I got to leverage UiPath, an automation tool build on .NET. In this role, I got the opportunity to mentor other team members and take a bigger role and in the design and architecture of the automations our team delivered.\n\nOne of the most challenging projects I worked on was the Cloud Recovery project. There was a Ransomware attack, which led to the loss of many customer environments, over 5000 unique environments. During this time, I was part of the Automation Development team, and our team was brought it to help with the recovery. This immediately became the top priority for our team as the recovery of these environments was time-sensitive. What made it challenging on a technical level was, firstly, that the requirements weren't fully clear; the steps for the recovery weren't originally documented and there were multiple variables that affected how a environment was to be recovered. Ironically, one of the most important things for a process to be a good candidate for automation is clear and repeatable steps. Secondly, one of the biggest drawbacks of UI automation is working within Virtual Machines; the automation had to access each individual environment in this way, therefore the automation was brittle and we had to constantly update the logic. \n\nThere were additional aspects that made this project challenging, such as working long hours for almost two months, many hands involved and lack of communication, which caused some rework, and other things.\n\nHowever, I am glad I went through that experience. The high intensity environment made it feel like doing a hackathon at times, I got to make new relationships and to contribute largely to this effort.",
    "minSalary": 0,
    "maxSalary": 0,
    "postingUrl": "https://automattic.com/work-with-us/job/core-engineering/",
    "hiringTeam": "",
    "techStack": []
  },
  {
    "id": 110,
    "jobTitle": "Sr. Backend Engineer",
    "companyName": "Appcues",
    "status": 0,
    "dateApplied": "2024-07-19T00:00:00",
    "jobDescription": "Your work as a Sr. Backend Engineer will empower thousands of Appcues customers to improve their SaaS products with unique in-app experiences such as onboarding guides, checklists, and surveys, without writing any code. Our customers, such as Codepen, Lyft and Segment, depend on our services to deliver these in-app experiences to 100s of millions of users. This role is a unique opportunity to join a small, senior team designing, building, and operating modern services at scale\nTools we use\nOn any given project, you will develop or refactor distributed Elixir or Node services and provision, tune, and manage data in DynamoDB, PostgreSQL, or whatever is needed. You'll work with AWS and Linux to manage and update production systems.\nOur team follows a Kanban flow using Shortcut to track our work. We communicate via Github, Slack, and Zoom, and are committed to remote, agile development.\nWhen you are ready, you’ll create and send a pull request with tests and tag your team for review. We use CircleCI to deploy to production and continuously invest in our pipelines and staging environments to make them more robust. \nEvery engineer is given ample opportunity to learn the Appcues product and codebase, with continual opportunities to demonstrate your abilities.\nAbout the role\nThe engineering team currently has 38 people across all of our teams. We are looking to hire a Senior Backend Engineer for our platform team.\nOur Platform team is responsible for crafting scalable services that handle millions of requests from our customer's SaaS products. They also manage RESTful and GraphQL APIs that process requests from our customer-facing React applications for personalization, segmentation, and targeting. The team collaborates to instrument and monitor the performance and availability of the Appcues platform.  \nOn a typical day, you may build a feature, tune a data pipeline, plan a technology migration, add a 3rd party integration, help diagnose a customer issue, drive consensus on a new practice, or collaborate with another engineer. \nOur engineers are involved in all development stages, including conception, design, and user-testing, with an eye toward rapid, agile iteration. You’ll collaborate with engineers across teams to develop new capabilities in our platform.\nYou’ll collaborate across the organization with design, customer success, technical support, and sales to translate customer needs into high-quality code.\nAbout you\nYou are energized by working in a highly collaborative environment at a customer-driven startup. You see software engineering as a team sport and like collaborating with fellow engineers, product managers, and others to deliver customer value. \nYou have experience in a similar SaaS company, preferably taking ownership over the build/deploy/infrastructure.\nYou have contributed to the delivery of large backend projects. For example, systems that ingest and process data at a significant scale, manage elastic workloads using queue/worker/streaming architectures, or migrate to more current technologies while maintaining high availability.\nYou have experience with functional programming or a desire to learn. We can teach you Elixir, which is the foundation of most of our Platform services.\nYou have sound judgment across back-end frameworks and are familiar with various databases and data processing technologies. You are pragmatic, not dogmatic, and are aware of the strengths & weaknesses of your tools.\nYou enjoy breaking down complex problems into small tasks and PRs to deliver value safely and incrementally. \nYou consider testing, monitoring, and observability first-order priorities. You believe your work isn't complete until your code runs in production and returns the results and metrics you expect.\nYou can comfortably work 9-5 Eastern Time.  While we are a 100% remote-1st company and you can connect from anywhere, we require 8 hours overlap to collaborate effectively with the rest of our team members who work these hours.\nMust be located within +5/-5 hours from Eastern Time\nAppcues does not support H1B applicants at this time\n$133,000 - $165,000 a year\nNote - Appcues uses a market-data driven approach to setting compensation ranges, and pins compensation ranges to data provided by third-party organizations. This range is for all US-based candidates and is built to be competitive nationwide by utilizing ranges for the Greater Boston area, regardless of where in the US an employee lives (or later relocates). This range represents salary-based compensation and does not include our equity package (in stock options), 401k match, or other benefits including an office setup budget, tech budget, training and education budget, and co-working space reimbursements. Actual compensation offered to a successful applicant may be based on job-related experience and other factors consistent with applicable law. For non-US based candidates, Appcues adjusts salary ranges based on cost of labor in each market. If you have questions on the pay range in your country, the recruiter will be happy to discuss specifics during your introductory conversation.\"\n\nAbout Us\n\nAppcues' mission is to help teams deliver experiences their users love. Our vision is for every software company to embrace product-led growth, resulting in more engaged and happier users.\n\nOur Benefits\n\n100% remote - We don’t have an office so all of our employees learn and collaborate in the same way using remote work practices. This won't change post-COVID as we are committed to being 100% remote for the long-term. We work in Slack, Zoom, and a collection of modern collaboration tools. We have inclusive remote events and we get together annually for a fun off-site retreat.\nWell-being - You'll have solid health, dental, and vision plans; access to 401k, and a generous maternity and paternity leave.\nFair pay - Each role has a defined salary band, bands and salaries are audited on a regular basis to help maintain fairness and market value\nHome office and tech budget - Besides paying for your work computer (Mac or PC), we offer a one-time $1000 home office stipend and an additional $500 annual budget for extra work-related technology.\nCoworking space, on us - Home office not cutting it? We'll reimburse your monthly coworking fees.\nEquity - We want everyone invested in our success. We grant every employee equity in the company.\nTransparency and collaboration - We foster team alignment with meetings of all shapes and sizes—a monthly all-hands meeting called FirstThurs, weekly team lunches, and Lunch & Learns., and an annual learning stipend.\nFlexible Time Off - We believe time away to reflect and explore makes us all more productive, so employees don’t accrue vacation time – they work with their managers to schedule time off when they need it, consistent with our Flexible Time Off policy. Employees based in the USA also take off all US federal holidays. Employees residing in other countries can choose to follow their local national holidays or US federal holidays.\n",
    "notes": "",
    "minSalary": 133000,
    "maxSalary": 165000,
    "postingUrl": "https://jobs.lever.co/appcues-2/7fc9fa0d-5143-403a-aa95-0f22de4b3670",
    "hiringTeam": "Platform team",
    "techStack": []
  }
]
